const journalData = {
  class1: {
    2: {
      title: "第二週: 讀辛波絲卡〈寫履歷表〉",
      photos: [
        {
          src: "img/class1/W2.jpg",
          caption: "學生在討論選擇能力強項卡"
        },
        {
          src: "img/class1/W2_2.jpg",
          caption: "老師對同學提出履歷相關問題"
        },
        {
          src: "img/class1/W2_3.jpg",
          caption: "各組當老闆提出兩項能力應徵條件"
        },
        {
          src: "img/class1/W2_4.jpg",
          caption: "在各組老闆提出能力條件下，各組換位思考當員工時，來選擇最想應徵公司的條件"
        }
      ],
      record: {
        summary: "為了迎接讓學生大概有一些對於在履歷上的技能能力和一些自我探討過程，老師讓學生透過大組的活動來找到學生對自己系上該具備的能力來探討自己也讓學生可以換為思考在老闆與員工之間的看履歷條件等等。"
      },
      activities: [
        {
          title: "活動一",
          content: "老師讓學生分組討論，並以兩組合併為一大組、每個大組選擇自己認為本系學生該具備的能力，抽出 10 張卡片。最後，每個大組會拍照，並與其他大組比較，若同一張卡出現兩次以上，則在卡上加 1 分。",
          observation: ""
        },
        {
          title: "活動二",
          content: "同樣依照上述方式進行，但題目改為「自己已經具備的能力」，列出 10 張能力卡。",
          observation: "透過這兩項活動，老師引導學生進行初步的自我探討，思考自己在系上應具備哪些能力，同時也幫助同學思考自己已經具備能力強項。各組皆積極討論並選擇能力卡，不過在觀察中，第十二組和第十三組討論時較不積極，但兩組最後仍完成了活動成果。"
        },
        {
          title: "活動三",
          content: "進入課程核心，老師請學生換位思考：「如果你是老闆，你會提出怎麼樣的條件來應徵員工？」各組進行討論並將條件內容寫在黑板上。接著，每組派代表說明為何要開出這些條件，以及形成這些想法的原因，讓學生能反思與回答。",
          observation: ""
        },
        {
          title: "活動四",
          content: "如果自己是員工，要選擇哪三家公司的條件？各組從第三活動所開出的應徵條件中進行選擇最想應徵的條件。透過此活動，可以觀察學生們認為在職場上哪些條件最適合自己未來求職。",
          observation: ""
        }
      ]
    },
    3: {
      title: "第三週: 閱讀辛波絲卡〈寫履歷表〉",
      photos: [
        {
          src: "img/class1/W3-1.jpg",
          caption: "學生進行討論詮釋被分配的辛波絲卡寫履歷表裡的文章。"
        },
        {
          src: "img/class1/W3-2.jpg",
          caption: "組員代表上台閱讀和詮釋組別討論的結果。"
        },
        {
          src: "img/class1/W3-3.jpg",
          caption: "老師對各組同學進行提問，請同學詮釋最後一段：「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」"
        },
        {
          src: "img/class1/W3-4.jpg",
          caption: "各組針對「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」提出一個形容詞，來表達自己對於這段文字的感受。"
        }
      ],
      record: {
        summary: "今天課程老師介紹辛波絲卡〈寫履歷表〉這篇文章，內容呈現了辛波絲卡在那個時代對於撰寫履歷表的看法。老師讓學生閱讀並進行討論，思考如何詮釋內文。在這個活動中，學生能夠說明文本想要表達的意思，同時也能依照自己的看法，說明是否認同作者的觀點。"
      },
      activities: [
        {
          title: "活動一",
          content: "簡單的讓學生填寫問卷，對於上週能力強項卡對齊能力活動。透過這份問卷，讓學生再次回顧上週完成的活動，同時思考並寫下自己有哪些新的發現與想法。",
          observation: ""
        },
        {
          title: "活動二",
          content: "老師閱讀整個內文後，進行分配內文句子讓各組進行討論與詮釋。接著每一組會指派一位同學上台說明，讓學生可以表達自己對內容的理解方式，同時提出個人觀點。上台過程中有部分同學會有點緊張，但有些組在自我表達意見上表現很好，特別是第五組、十三組和第十四組的同學。",
          observation: "在巡視同學討論與提議的過程中，有部分同學認為只要解釋本文的意思就好，沒想到其實可以提出自己是否認同這段文字，甚至能舉例分享自己的故事。第十四組的同學很有自己的主見，當時我與他們聊到時也建議同學可以在上台時講出自己過去的經驗。上台的同學大多著重在解釋文本的意思，少數組提出了自己的看法，對作者的想法進行反諷。"
        },
        {
          title: "活動三",  
          content: "各組要對最後一段「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」進行詮釋，老師也針對這一句向各組提問，讓同學表達自己的看法。這句很現實，每組別的同學都能抓住作者想表達的重點。",
          observation: ""
        },
        {
          title: "活動四",
          content: "當同學理解這句真正要表達的意思後，並讓每一組上台寫一個形容詞來描述自己當瞭解這句背後的意思會有甚麼的感受。同時，老師也會針對每一組討論後的形容詞答案，提出提問，讓同學說明為什麼會有這樣的感覺。",
          observation: "在表達形容詞，有同學對於：”無奈”和”無力”的理解有點模糊，老師有對同學說明的兩個形容詞的差別地方。"
        }
      ]
    },
    6: {
      title: "第六週: 創意履歷表-心智圖",
      photos: [
        {
          src: "img/class1/W6-1.jpg",
          caption: "同學在課本空白地方手寫作引導句。"
        },
        {
          src: "img/class1/W6-2.jpg",
          caption: "各組上台分享創作活動反履歷表的寫作內容"
        },
        {
          src: "img/class1/W6-3.jpg",
          caption: "同學在課堂上觀看心智圖教學"
        },
        {
          src: "img/class1/W6-4.jpg",
          caption: "同學開始動手繪製自我介紹心智圖"
        }
      ],
      record: {
        summary: "今天老師從辛波絲卡〈寫履歷表〉這篇文章內容進行回顧週三同學完成的課程上活動，接著補充說明和解釋文章的內容讓學生能夠了解對作者對於履歷表所表達的看法，此外對履歷表和能力強項卡進行比較，也說明在履歷表上會有哪些資訊無法呈現的，最後老師讓學開始動手寫作引導句。在下一堂課開始以自我介紹的心智圖呈現方式以展示影片和歷年範例讓學生進行製作。"
      },
      activities: [
        {
          title: "活動一: 創作活動反履歷表",
          content: "當說明和講解辛波絲卡〈寫履歷表〉課程內容後，老師讓每個同學進行創作活動：反履歷表。讓每位學生以「我曾在_____學會了_____、別人看不見但我珍惜的是_____、我希望被記住的不是頭銜，而是_____」的句型進行創作。創作後，老師請四組上台進行分享並讓學生對自己填寫的內容向老師說明。",
          observation: "在同學上台分享內容時，大家的想法真的很棒。我最喜歡的組員填寫內容是：「我曾在夢想中學會放棄、別人看不見但我珍惜的是自由、我希望被記住的不是頭銜，而是開心的一面。」我很意外大一的同學，居然能有這樣的想法對於夢想或理想目標，我也認同有時候需要學會如何放棄。給自己一些時間休息或做其他事情，因為太追求完美反而會讓自己過得很辛苦，事後也可能嚴重影響身心。有時候，學會「好好放棄」其實也是一件好事，因為在追求的過程中，那份努力本身就已經證明了自己很棒了。"
        },
        {
          title: "活動二: 自我介紹心智圖創作",
          content: "老師展示了如何開始製作一個自我介紹的心智圖，並讓學生親自繪製與創作屬於自己的自我介紹心智圖。透過前幾週老師帶領學生認識自己的強項，以及履歷表中可撰寫內容，讓學生在這次活動中能從多方向思考與發想，進而繪製出展現自我的心智圖。",
          observation: "老師還在講解過程有很多學生已開始對心智圖的中心點來繪製，多樂同學在繪畫很強，大家已經想好自己要的人物。"
        }
      ]
    },
    7: {
      title: "第七週: 創意履歷表-心智圖",
      photos: [
        {
          src: "img/class1/W7-1.jpg",
          caption: "同學在課本繪製心智圖"
        },
        {
          src: "img/class1/W7-2.jpg",
          caption: "同學完成作品進行佈展"
        },
        {
          src: "img/class1/W7-3.jpg",
          caption: "同學在創作履歷表展活動進行看展和互評。"
        },
        {
          src: "img/class1/W7-4.jpg",
          caption: "老師開問卷結果對同學們說明大家的回覆"
        }
      ],
      record: {
        summary: "課程延續上週的創作履歷表，讓同學繼續在課堂上進行自我介紹心智圖的創作，同時針對同學的作品給予建議與更改方向。在課程結束前，同學們會進行佈展、讓同學進行投票互評自己最喜歡的作品，最後再展示同學們的互評結果與心得回饋。"
      },
      activities: [
        {
          title: "活動一: 自我介紹心智圖創作",
          content: "接續上週的活動讓同學進行創作和補強更正作品，在這階段大家作品內容上已經有個基本主體框架。老師再次強調繪製的要求和注意事項：文字要在線上，至少要有三層，各區以不同顏色區分，和寫自己班級組別和姓名。",
          observation: "多樂班級的每位同學作品都很獨特，在主體繪畫方面、每位同學繪畫風格很獨特有自創少女風格人物，可愛角色與漫畫人物，還有一位同學和我分享他喜歡畫黑暗奇幻風格化的人物，大家的繪畫能力真的很強。在心智圖內容方面，有兩位同學把心智圖內容寫成一句段落式的說明，這時需要提醒同學以關鍵字呈現內容。其次是階層部分不夠，有部分同學的心智圖只有兩個階層。這次也遇到特別的情況：有部分同學以印刷方式繳交作業，因為目前觀察到在多樂班或其他視覺相關班級中，大家都很常使用 iPad 和繪圖板軟體進行創作。"
        },
        {
          title: "活動二: 自我介紹心智圖創作(看展和互評)",
          content: "在這活動同學們會進行看展，每位同學會有三的點點貼紙，要投票給三位同學的作品、同時要為這三個作品撰寫喜歡的理由、最後對於這次活動寫出自己的感想。",
          observation: "在觀展過程中，大家都很認真地欣賞每一件作品，仔細挑選自己想投票的對象。最容易吸引大家目光的部分是作品的主視覺，其次是心智圖上的內容。透過這次活動，我發現同學們也更認識班上彼此，甚至能找到同好或喜歡的畫風。整體來看，班級的氣氛變得更好，大家在投票時也願意主動互動交流。在投票過程中發生了許多有趣的情況：有些同學害羞會以自己組員投票、有同學因為只有三個投票點數覺得太少投票過程會很猶豫不決、有同學身下最後一票不知道要投給誰，最後這位同學決定投給自己好了。"
        }
      ]
    },
    8: {
      title: "第八週: 妙語說書人",
      photos: [
        {
          src: "img/class1/W8-1.jpg",
          caption: "老師講解遊戲運作方式和規則"
        },
        {
          src: "img/class1/W8-2.jpg",
          caption: "大組正在進行遊戲中"
        },
        {
          src: "img/class1/W8-3.jpg",
          caption: "同學在黑板上登記分數"
        },
        {
          src: "img/class1/W8-4.jpg",
          caption: "各組在篩選自己喜歡的卡牌，進行故事創作"
        }
      ],
      record: {
        summary: "今天的課程讓同學們進行「妙語說書人」桌遊，以兩組以上合併進行遊戲。透過說書人遊戲，讓同學能發揮想像力，描述並說明卡片上的圖像。遊戲結束後，各組會分享最有意思的兩張正確卡與誘答卡，並寫出說書人的題目及分享遊戲中的技巧。最後，各組成員選出一張卡，全組一起進行創作接龍故事。"
      },
      activities: [
        {
          title: "活動一: 妙語說書人",
          content: "分成兩組方式進行遊戲，每組人數至少六人以上。在遊戲開始前安排位置後，老師會開始講解遊戲中規則和如何進行，在遊戲計分規格老師有簡化過。在各組進行遊戲時，我和老師會進行觀察看每一組進行情況。",
          observation: "大家在遊戲中進行很順利！有一組卡在計分階段，這時有組員舉手我來進行協助和說明。此外比較晚到的同學有一名，我來講解後同學也很順利的玩。在第五,六組有一位同學要當說書人，老師讓我說明代替同學選一張並開始說書和投票，再下一場我有注意到，這位同學沒有與其他同學進行玩，反而只玩手機，後來我來詢問情況同學沒有回應只點頭。"
        },
        {
          title: "活動二: 遊戲分享與討論",
          content: "第一任務遊戲結束時會讓同學上台登記大組的成員中，第一名人分數最高，因此讓同學選出一組排兩張在玩過程最有意思的並把說書人的題目傳到群組上。第二任務每位同學分享寫上自己在遊戲中怎麼應用隱喻才能讓別人猜不出來，說明誘答是否成功？",
          observation: "在第一任務回應時，大家在取說書人的題目很有創意滿有趣，有些網路用語或詞我自己也不曉得例如：福瑞，和滿有趣一些題目像；阿努比斯的審判，實打實，jojo的奇幻冒險反派。第二任務回應誘答技巧整體每一組會覺得可以用一些抽象的描述和說書方式來騙別人，有的認為成功是靠運氣，但大多數都成功。有些組別覺得玩資訊差也很有用但他們沒有成功過。"
        },
        {
          title: "活動三: 故事接龍",
          content: "老師會讓各組每個人選出自己喜歡的卡牌，每個人會用這張卡創作故事來接龍到其他人故事，當學生們排序好卡牌後，各組會進行故事創作。",
          observation: "各組在故事創作上大家都很認真的撰寫整組故事接龍，我個人覺得第1,11,12這大組故事也寫得很好很有想像力，這故事比北極熊還要冷還有外太空兔子，很驚訝居然是故事中的故事。"
        }
      ]
    },
    9: {
      title: "第九週: 生命書寫四路徑-氣味、那些年我們一起回憶",
      photos: [
        {
          src: "img/class1/W9-1.jpg",
          caption: "老師講解今天課程要上的楊照<氣味>。"
        },
        {
          src: "img/class1/W9-2.jpg",
          caption: "組員進行閱讀和討論楊照<氣味>這篇故事時序。"
        },
        {
          src: "img/class1/W9-3.jpg",
          caption: "組員代表上台說明自己答案和講故事的細部內容。"
        },
        {
          src: "img/class1/W9-4.jpg",
          caption: "組員在那些年我們一起回憶活動繪製感官回憶心智圖"
        }
      ],
      record: {
        summary: "這週次課程談到感官讓人們會容易引起回憶這件事，透過楊照<氣味>這裡面的故事，老師講解完文章後會讓學生進行閱讀並分組討論文章的故事時序，最後讓每一組上台講解故事分享答案。當了解人的感官會讓我們更容易回憶後老師讓每一組進行繪製心智圖關於各組每成員回憶的感官故事那些年的回憶。"
      },
      activities: [
        {
          title: "活動一: 楊照<氣味>故事時序整理",
          content: "在進行活動前老師講解楊照<氣味>這篇文說明的內容和作者如何透過感官想起故事、在文章說明過程，老師會讓學生透過本文判斷本文作者的回憶做過事是否道德在把教官推入荷花池這件事，也證明透過嗅覺無論是否道德，她聞到這味道這時會讓他回憶這件事情。在活動內，會有12段故事讓同學依序排列事情發生的順序。每一組會一起討論，在作業紙本上撰寫號碼。接下來會讓每一組指派一位代表上台講自己組員的答案。",
          observation: "第一上台組會卡在故事說明部分，同學未把握好故事裡面的細節內容。但在作答故事時序時都不會有錯誤。大家上台有點害羞不太敢面對台下的同學，有一部分組別像第四組同學在說明故事表現得很好！還特別兩人一起上台說明。此外因在期中考週，我看到好幾位同學正在看題庫準備明天的考試項目，也許這原因讓大家在課堂中專心度還不夠。"
        },
        {
          title: "活動二: 感官故事那些年我們一起回憶",
          content: "在這活動每一組同學會完成一個感官故事心智圖，在製作上老師給同學兩個方向製作，第一方向選定單一時期來寫感官回憶，第二方向是選擇單一感官來寫那時期的回憶。製作規則與心智圖呈現方式一樣，文字要在線上，組員裡面提供的故事關鍵字會標註自己的名字。",
          observation: "大部分組別選擇第一方向來製作感官故事回憶的作品，大家在執行上不遇到太大的困難。在同學們進行活動過程大家感覺滿喜歡，特別在彼此回想自己的回憶有些覺得很搞笑的回憶，有些回憶讓每個人都有共鳴，每個組員氣氛上好的很多。在作品方面，因為是多樂同學不需多說，作品視覺繪製上水準很高。關鍵字上也有很多故事對我自己也有同感，也稍微回憶自己國小國中時期，感官上的回憶真的令人難忘。"
        }
      ]
    },
    10: {
      title: "第十週: oh! Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
      photos: [
        {
          src: "img/class1/W10-1.jpg",
          caption: "同學們正在進行投票，把貼紙貼到感官故事心智圖上有趣的故事。"
        },
        {
          src: "img/class1/W10-2.jpg",
          caption: "學生們分享被投票的感官故事心智圖回憶。"
        },
        {
          src: "img/class1/W10-3.jpg",
          caption: "學生在感官地圖活動撰寫200個字關於自己印象深刻的回憶故事。"
        },
        {
          src: "img/class1/W10-4.jpg",
          caption: "觀看完關於憂鬱症研究影片學生寫影片的重點。"
        }
      ],
      record: {
        summary: "延續上一周的課程，老師讓同學進行看展投票到有趣和喜歡的心智圖上的感官故事，接著老師會對本班被投票的人進行分享他們的故事回憶，最後讓學生對自己回憶最深刻故事事件寫成200個字的回憶。第二節進入新課程單元：【親愛的我、oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖】，老師讓學生觀看憂鬱影片並讓學生上台寫影片中內容重點，當了解憂鬱症相關後，老師帶領學生觀看這單元的主角，透過本人紀錄片，最後讓學生閱讀課文把內文的事件整理成心智圖。"
      },
      activities: [
        {
          title: "活動一: 感官故事心智圖觀賞和分享",
          content: "延續上一周的課程，老師讓同學進行看展，每個人手上會有兩個點投票到喜歡的心智圖上的故事，老師會分批讓每一組進行觀賞和投票、接著我會拍照同學投票好的照片上傳到班群，讓老師進行播放，老師會選擇本班被投票的故事來讓各組分享故事細節的給大家領聽。",
          observation: "大家選擇故事都跳選很有趨和搞笑事情，大家的國高中也太有趣了。例如：綠色漱口水，更誇張是有人把廁所門拆下來。在這活動每個同學積極地參加，很樂觀地分享自己的回憶給大家聽，也許透過這活動可能每個同學之間會有更多之間有趣事情可以交流，這活動也會讓大一生同學可以有更多機認識自己班上同學。"
        },
        {
          title: "活動二: 感官地圖",
          content: "在這活動老師讓同學針對自己印象深刻事件進行撰寫至少200個字的回憶。這是四個路徑其中一部分讓同學可以進行發展成未來可參考的1000生命故事。",
          observation: "大家在進行撰寫大家都寫好寫滿超過或剛好到200個字，很驚訝得有幾組都寫超過需要多加三張紙本、有部分同學只會應付今天課程把當天的事件撰寫到自己作業上。有部分同學很認真寫到快下課，這幾位在未來的期末1000生命故事完成能力上感覺不會有帶大的問題。"
        },
        {
          title: "活動三: 憂鬱症研究影片觀看，重點整理",
          content: "在整備上oh!Dear me 250天憂鬱症紀實情緒年史這單元，在簡報講解外，老師播放關於憂鬱症研究影片讓學生對憂鬱症的相關內容了解，為了確保大家專心看，老師指派任務讓同學記住影片中的關鍵內容並以各組上台寫。",
          observation: ""
        },
        {
          title: "活動四: 憂鬱症紀實情緒年史紀錄片，心智圖整理",
          content: "當學生了解關於憂鬱症相關研究後，老師會進行說明單元課程裡面的人物（過去得到憂鬱症患者的250天記錄）。然後讓學生觀看內文人物的紀錄片。最後老師會讓學生進行閱讀文本，學生在組員分配進行把文本裡面的事件整理成心智圖。",
          observation: "大家在觀看影片時很認真，關於憂鬱症相關重點每一組都有抓好。在看紀錄片，這紀錄有點沉悶有關文本裡面的人面對憂鬱症和過程的感受和分享關於她。大家觀看時很專心，看到一個人訪談大家看起來對這紀錄片很有感有同理或為一個人而難過。"
        }
      ]
    },
    11: {
      title: "第十一週: 專案演講情緒照顧_自我照顧",
      photos: [
        {
          src: "img/class1/W11-1.jpg",
          caption: "講師正在講解關於照顧身心的! 打造幸福的能量花園--情緒照護的議題"
        },
        {
          src: "img/class1/W11-2.jpg",
          caption: "同學正在撰寫七項對自己是很重要的。"
        },
        {
          src: "img/class1/W11-3.jpg",
          caption: "同學正在閉上眼睛五感靜觀練習 。"
        },
        {
          src: "img/class1/W11-4.jpg",
          caption: "同學們正在選出喜歡的裝飾來放入心靜瓶。"
        }
      ],
      record: {
        summary: "今天課程邀請一位講師任蕙茹講師演講關於如何情緒照顧_自我照顧主題，演講過程講師除了說明一個人身心相關敘述，老師也讓同學觀看透過科技等方法來改善長者憂鬱症。當了解演講背景後講師帶學生進行寫出自己七個能讓自己平或滿足的最重要事件人物等等，接者依序的刪除自己寫出每個重要東西一直到剩下最後一個，因此讓每位同學說出自己留下最後一個最重要的讓老師統計下來。接下來講師說明相關大腦研究文獻容易收到負面思想，說明研究中的狗狗實驗案例講解，最後帶領學生們進行放鬆紓壓技巧讓同學如何透過呼吸和人的五感靜觀練習，課程後面讓同學製作屬於自己的靜心瓶。"
      },
      activities: [
        {
          title: "活動一: 感官故事心智圖觀賞和分享(演講與價值觀探索)",
          content: "在活動的開始講師演講關於情緒照顧背景等相關議題和讓同學觀看目前的在科技上的應用例子：如何透過VR虛擬3D技術來讓長者擺脫憂鬱症疾病，活動過程老師會讓學生寫下對自己會滿足或平心的七項對自己重要。在完成撰寫後，到第二階段大家要對自己寫下的內容刪除四個，在第三階段老師在讓同學刪除兩個項目留下最後一個自己覺得最重要的。",
          observation: "在開始寫的階段，有部分同學還不清楚能列出哪七個項目能對於自己會滿足或平靜或最重要的事件，我有建議同學不要想太難。在刪除過程有些同學任為七個是最重要所以都不刪除，在進行每一位同學表達自己留下來最後一個過程，老師統計後發現大多數同學以家人和親人是最重要的，其次是金錢，快樂和健康。如果是我我也會選擇親人和家人這選項，因為在人生當中他們是個從小陪伴到大的人。"
        },
        {
          title: "活動二: 五感靜觀練習",
          content: "在這活動講師會帶領學生了解人類為何大腦會偏好負向思考，而正向思考需要透過一種經歷的練習所造成的，老師也講解一個狗狗上的實驗從實驗可以知道人只要不放棄就可以從質得無助到質得樂觀這轉念，接者老師也讓學生觀看一些常常聽的負面的內容影片。在要進入五感靜觀練習老師在面前示範給同學要說怎麼口號，和如何慢慢的靜下來。",
          observation: "在影片播放內容大家很有感，其實人負面專狀態下會無意的講出傷害親人的話，影片中提醒我們在對家人或親友對話時有時候簡單的一些不好聽的話也讓他們得到不少的受傷。在五感靜觀練習，他家有好好的執行，有些可能維持不久狀態，有些同學有練習到最後。"
        },
        {
          title: "活動三: 製作屬於自己的靜心瓶",
          content: "同學會製作自己靜心瓶，大家會開始選擇自已喜歡的裝飾品。這活動大家作品很多獨特的靜心瓶，有的會以純金色搭配黃色的牛寧片裝飾，有的會有自己英文字母在靜心瓶裡面。完成作品每位同學很喜歡自己親手作出的作品，而且同學很創意會使用燈來照亮作品。",
          observation: ""
        }
      ]
    },
    12: {
      title: "第十二週: oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
      photos: [
        {
          src: "img/class1/W12-1.jpg",
          caption: "老師播放一個關於憂鬱症感受的歌"
        },
        {
          src: "img/class1/W12-2.jpg",
          caption: "同學正在繪製情緒地圖"
        },
        {
          src: "img/class1/W12-3.jpg",
          caption: "同學在選擇兩張情緒卡"
        },
        {
          src: "img/class1/W12-4.jpg",
          caption: "第一組同學正在撰寫情緒200個字"
        }
      ],
      record: {
        summary: "接續第十週oh!Dear me 250天憂鬱症紀實情緒年史和第十一週的演講關情緒照顧、自我照顧的演講，課程繼續到文本的細部內容，老師會讓學生觀看關於情緒方面的演講影片和領聽有關於憂鬱症歌。其次讓學生寫出自己過去重要事情、選擇對自己很有感的情緒卡最後對一件重要過去事情撰寫200個字。"
      },
      activities: [
        {
          title: "活動一: 情緒地圖",
          content: "在這活動執行前老師帶入學生更深入了解關於情緒的議題，讓學生瞭解人們怎麼認識情緒和憂鬱症人跟一般人感受到外在世界的差異，老師也播放演講和歌。在情緒地圖上學生會以x軸為時間線，y軸為情緒強烈負面和正面的經驗，讓學生進行寫出對自己5到8件重要生命故事事件，大家時間軸會以過去的範圍如小學國中高中等年齡回想自己在當下回憶的情緒和事件。",
          observation: "大家在課堂中想出過去太久的事情有時候會很困難，但在這課程設計上也許在強烈的正面負面事件會讓人們記得很深刻。大家在情緒地圖繪製上和撰寫內容各式各樣都有，有很多正面一個負面，也有正面負面事件記得很深。"
        },
        {
          title: "活動二: 情緒地圖抽情緒卡，選一件是撰寫內容",
          content: "在延續第一活動學生們會進行抽情緒卡，選擇兩張可能對自己目前的感受相同或自己有興趣的卡片，接著學生會觀看卡片上描寫的情緒有哪些對剛剛完成情緒地圖上的事件很相似很有感。最後學生會選在情緒地圖選擇一個很有感會對自己印象很深刻的事件的寫出200個字，以四個問題回答，當時發生甚麼？，我的感覺是甚麼？，我怎麼樣的進行撰寫或同學自行描述該事件的發生和當下情緒。",
          observation: "同學們在撰寫過程遇到最大問題有些細節內容無法敘述或太久而忘，但有部分同學還是會有最有印象深刻重要事件撰寫，情緒卡在這次撰寫也很重要也是一種輔助同學們聯想到情緒地圖上的當時的情緒情況。"
        }
      ]
    },
    13: {
        title: "第十三週: 因為我植得—園藝治療與自我價值探索",
        photos: [
          {
            src: "img/class1/W13-1.jpg",
            caption: "專家演講：因為我植得，園藝治療"
          },
          {
            src: "img/class1/W13-2.jpg",
            caption: "閱讀《達利B的旅程》探索自我特質"
          },
          {
            src: "img/class1/W13-3.jpg",
            caption: "進行愛之語測驗與特質卡轉念練習"
          },
          {
            src: "img/class1/W13-4.jpg",
            caption: "同學專心製作療癒水苔球"
          }
        ],
    record: {
      summary: "第十三週課程以專家演講「因為我植得」為主題，在今天課程會邀請專家老師帶學生們進行演講，關於「因為值得，值得的園藝治療」。<br>活動中老師會讓學生進行各種活動，讓學生可以在這些活動中探索自我價值，找出自己的特質和在不同關係中最喜歡、最渴望的表達愛，以及自己希望別人怎麼對待自己是最舒服的。<br>最後老師帶學生製作水苔球，讓學生可以透過植物來療癒自己，讓它們在一年四季成為我們最好的陪伴。"
    },
    activities: [
      {
        title: "活動一: 閱讀《達利B的旅程》與自我對話",
        content: "在這活動老師會讓每位學生閱讀投影上的小說，關於動物之間的溝通。故事裡面是動物之間詢問自己是什麼動物、是什麼的角色，動物們會是如何尋找自己是誰，主要尋找自我，也因為兔子的優異特質（大腳）讓他拯救了兔子們並成為他們眼中的英雄。<br><br>完成閱讀後，老師讓學生進行回答問題:<br>1.自我探索與認同：成長過程面對自我存在的疑惑？思考自己的特質和喜好?<br>2.自我探問，我是誰? 我喜歡什麼?<br><br>最後同學們需要寫出自己的三個特質（正向特質）。讓學生可以思考自己目前具備哪些特質，是在與人互動方面或道德上有關的正向特質。",
        reflection: "我最印象深刻是關於兔子的劇情，因為兔子遇到某些危機的動物時，那動物對兔子說：我會吃兔子，但兔子反而疑問的說自己是兔子嗎？後面透過一些說服，說自己大腳所以不可能是兔子，反而因為這件事兔子成為了兔子們的英雄。<br>在特質表我自己覺得會列為：勇敢，活潑，開朗這三個特質。",
        observation: "透過讓大家每個人閱讀方式，大家可以更容易專心聆聽其他同學的發言。在了解《達利B的旅程》故事後，學生們在探索自己過程也許更容易。在回答問題方面，對於了解自己有什麼特質，有同學不知自己會有哪些特質，但老師有提供特質表讓同學好寫點。"
      },
      {
        title: "活動二: 特質轉念與愛的五種語言",
        content: "老師會給學生看特質卡片，對每個特質上說明。此外也讓學生思考如何把負面特質說成正面的，例如：「你很依賴對方」，依賴是有帶點負面形容，如果換成正面方式可以說：「你對對方很信任」。<br><br>另一個活動是老師會讓學生觀看五種表達愛的方式：<br>1.肯定的語句<br>2.肢體的接觸<br>3.送禮物<br>4.服務的行動<br>5.精心時刻<br><br>讓學生選擇前三個最喜歡被別人或親人的表達愛方式。其次學生會進行測驗30題的愛之語線上測驗，最後可以看出在這五種表達愛方式的排名，同時可以對比剛剛在紙本上寫的三個最喜歡是否相同。",
        reflection: "在要把負面特質說成正面的有點困難，我想了有點久才認為對於「依賴對方」這特質，說成因為對他們有信任才會有依賴的事情。<br>老師在演講有說到人類腦子出生就帶有負面思想方向，要正面需要累積要練習。在要把負面特質說成正面的有點困難，我想了有點久才認為對於依賴對方這特質，說成因為對他們有信任才會有依賴的是情。老師在演講有說到人類腦子出生就帶有負面思想方向，要正面需要累積要練習。"
      },
      {
        title: "活動三: 製作水苔球",
        content: "最後大家在活動上會進行製作水苔球，每個人可以選自己喜歡的植物來製作。每個人可以選擇喜歡植物，此外老師也準備小裝飾可以插在水苔球上。",
        observation: "大家在製作過程很用心觀看老師播放的教學影片，因為是有動手實作，大家製作過程有很多同學需要幫忙，大家很專心地完成自己的產品。<br>最後下課我感覺每個人都很開心，因為沒想到在這門課可以製作水苔球，並放在自己房間可以陪伴自己過日子。"
      }
    ]
  },
    14: {
      title: "第十四週: 生命書寫四路徑--生命圖象 生命圖象創作",
      photos: [
        {
          src: "img/class1/W14-1.jpg",
          caption: "老師展示歷年學長姊的生命圖像。"
        },
        {
          src: "img/class1/W14-2.jpg",
          caption: "同學正在繪製生命圖像草稿，正在上色。"
        },
        {
          src: "img/class1/W14-3.jpg",
          caption: "同學以ig畫面和彩色泡泡繪製生命圖像。"
        },
        {
          src: "img/class1/W14-4.jpg",
          caption: "同學以複雜的畫面繪製和黑暗的顏色來繪製生命圖像"
        }
      ],
      record: {
        summary: "第十四的課程關於生命圖像創作活動，在課堂上老師會說明生命圖像的創作方式以及展示歷年的學長姐們的生命圖像作品等作品。最後同學們需要填寫200個字創作說明。"
      },
      activities: [
        {
          title: "活動一: 生命圖像創作",
          content: "在創作前老師展示學長姐不同的創作作品以及說明如何創作自己的生命圖像，同學們會為自己思考我生命像什麼並使用一個物品，動物或人物，風景等等來繪製自己生命圖像，此外在圖像上要寫出七到八件關於自己生命中的重要的正面和負面事件。<br><br>  在歷年學長姊作品上有不一樣的創作想法，有學長把自己生命繪製如鋼琴一樣，黑色的鍵學長標上自己過去遇到不開心事件，白色鍵表示歡樂事件等等，如：考到好大學，第一次出國。也有人把人生如漢堡一樣，漢堡不同層的漢堡上表示不同事件，自己最不喜歡吃的（番茄）會標上負面事件。",
          observation: "在同學開始想題材中，大家會遇到困難不知道要繪製甚麼。也有部分同學很快就想到要畫甚麼生命圖像，如：有同學把生命繪製成ig版面，周圍是多彩的泡泡來表達自己每件重要事情，有同學繪製一個女生人物，上面正在飛行的流星是他人生的各個事件。<br>在繪製過程中，大家都很認真在完成自己的作品，並且有些同學會使用不同的顏色來表達自己生命中的正面和負面事件。<br>此外也有一組男同學繪製很簡略，一個臉部只有嘴巴，同學以微笑和難過的嘴型來形容自己在生命中的快樂或難過的事件，也有同學以自己最愛的小鼠來繪製成自己人生。最特別是在第十三組有一位女同學用比較偏黑暗的色彩和複雜的構圖來繪製自己的生命圖像因為作品未完成，我滿期待的。"
        },
        {
          title: "活動二: 生命圖像創作說明200字",
          content: "如果同學完成作品後，會需要填寫200個字，主要會以開場是:我生命就像...，我的生命彷彿像是...。人生就像…,十八歲的我就像…。",
          observation: "因為每個同學繪製的速度有所不同，所以大部分同學會下週繳交作業包含創作說明。同學創作過程最花時間是想代表自己人生物體和開始繪製草稿。"
        }
      ]
    }
},
    class2: {
        1: {
            title: "第一週:感官故事與憂鬱症探討",
            photos: [
                { 
                    src: "img/class2/week1/photo1.jpg",
                    caption: "乙班課程照片待更新" 
                }
            ],
            record: {
                summary: "乙班課程記錄待更新..."
            },
            activities: []
        }
    },
    class3: {
        1: {
            title: "第一週:感官故事與憂鬱症探討",
            photos: [
                { 
                    src: "img/class3/week1/photo1.jpg",
                    caption: "丙班課程照片待更新" 
                }
            ],
            record: {
                summary: "丙班課程記錄待更新..."
            },
            activities: []
        }
    }
};