const journalData = {
  class1: {
    2: {
      title: "第二週: 讀辛波絲卡〈寫履歷表〉",
      photos: [
        {
          src: "img/class1/W2.jpg",
          caption: "學生在討論選擇能力強項卡"
        },
        {
          src: "img/class1/W2_2.jpg",
          caption: "老師對同學提出履歷相關問題"
        },
        {
          src: "img/class1/W2_3.jpg",
          caption: "各組當老闆提出兩項能力應徵條件"
        },
        {
          src: "img/class1/W2_4.jpg",
          caption: "在各組老闆提出能力條件下，各組換位思考當員工時，來選擇最想應徵公司的條件"
        }
      ],
      record: {
        summary: "為了迎接讓學生大概有一些對於在履歷上的技能能力和一些自我探討過程，老師讓學生透過大組的活動來找到學生對自己系上該具備的能力來探討自己也讓學生可以換為思考在老闆與員工之間的看履歷條件等等。"
      },
      activities: [
        {
          title: "活動一",
          content: "老師讓學生分組討論，並以兩組合併為一大組、每個大組選擇自己認為本系學生該具備的能力，抽出 10 張卡片。最後，每個大組會拍照，並與其他大組比較，若同一張卡出現兩次以上，則在卡上加 1 分。",
          observation: ""
        },
        {
          title: "活動二",
          content: "同樣依照上述方式進行，但題目改為「自己已經具備的能力」，列出 10 張能力卡。",
          observation: "透過這兩項活動，老師引導學生進行初步的自我探討，思考自己在系上應具備哪些能力，同時也幫助同學思考自己已經具備能力強項。各組皆積極討論並選擇能力卡，不過在觀察中，第十二組和第十三組討論時較不積極，但兩組最後仍完成了活動成果。"
        },
        {
          title: "活動三",
          content: "進入課程核心，老師請學生換位思考：「如果你是老闆，你會提出怎麼樣的條件來應徵員工？」各組進行討論並將條件內容寫在黑板上。接著，每組派代表說明為何要開出這些條件，以及形成這些想法的原因，讓學生能反思與回答。",
          observation: ""
        },
        {
          title: "活動四",
          content: "如果自己是員工，要選擇哪三家公司的條件？各組從第三活動所開出的應徵條件中進行選擇最想應徵的條件。透過此活動，可以觀察學生們認為在職場上哪些條件最適合自己未來求職。",
          observation: ""
        }
      ]
    },
    3: {
      title: "第三週: 閱讀辛波絲卡〈寫履歷表〉",
      photos: [
        {
          src: "img/class1/W3-1.jpg",
          caption: "學生進行討論詮釋被分配的辛波絲卡寫履歷表裡的文章。"
        },
        {
          src: "img/class1/W3-2.jpg",
          caption: "組員代表上台閱讀和詮釋組別討論的結果。"
        },
        {
          src: "img/class1/W3-3.jpg",
          caption: "老師對各組同學進行提問，請同學詮釋最後一段：「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」"
        },
        {
          src: "img/class1/W3-4.jpg",
          caption: "各組針對「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」提出一個形容詞，來表達自己對於這段文字的感受。"
        }
      ],
      record: {
        summary: "今天課程老師介紹辛波絲卡〈寫履歷表〉這篇文章，內容呈現了辛波絲卡在那個時代對於撰寫履歷表的看法。老師讓學生閱讀並進行討論，思考如何詮釋內文。在這個活動中，學生能夠說明文本想要表達的意思，同時也能依照自己的看法，說明是否認同作者的觀點。"
      },
      activities: [
        {
          title: "活動一",
          content: "簡單的讓學生填寫問卷，對於上週能力強項卡對齊能力活動。透過這份問卷，讓學生再次回顧上週完成的活動，同時思考並寫下自己有哪些新的發現與想法。",
          observation: ""
        },
        {
          title: "活動二",
          content: "老師閱讀整個內文後，進行分配內文句子讓各組進行討論與詮釋。接著每一組會指派一位同學上台說明，讓學生可以表達自己對內容的理解方式，同時提出個人觀點。上台過程中有部分同學會有點緊張，但有些組在自我表達意見上表現很好，特別是第五組、十三組和第十四組的同學。",
          observation: "在巡視同學討論與提議的過程中，有部分同學認為只要解釋本文的意思就好，沒想到其實可以提出自己是否認同這段文字，甚至能舉例分享自己的故事。第十四組的同學很有自己的主見，當時我與他們聊到時也建議同學可以在上台時講出自己過去的經驗。上台的同學大多著重在解釋文本的意思，少數組提出了自己的看法，對作者的想法進行反諷。"
        },
        {
          title: "活動三",  
          content: "各組要對最後一段「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」進行詮釋，老師也針對這一句向各組提問，讓同學表達自己的看法。這句很現實，每組別的同學都能抓住作者想表達的重點。",
          observation: ""
        },
        {
          title: "活動四",
          content: "當同學理解這句真正要表達的意思後，並讓每一組上台寫一個形容詞來描述自己當瞭解這句背後的意思會有甚麼的感受。同時，老師也會針對每一組討論後的形容詞答案，提出提問，讓同學說明為什麼會有這樣的感覺。",
          observation: "在表達形容詞，有同學對於：”無奈”和”無力”的理解有點模糊，老師有對同學說明的兩個形容詞的差別地方。"
        }
      ]
    },
    6: {
      title: "第六週: 創意履歷表-心智圖",
      photos: [
        {
          src: "img/class1/W6-1.jpg",
          caption: "同學在課本空白地方手寫作引導句。"
        },
        {
          src: "img/class1/W6-2.jpg",
          caption: "各組上台分享創作活動反履歷表的寫作內容"
        },
        {
          src: "img/class1/W6-3.jpg",
          caption: "同學在課堂上觀看心智圖教學"
        },
        {
          src: "img/class1/W6-4.jpg",
          caption: "同學開始動手繪製自我介紹心智圖"
        }
      ],
      record: {
        summary: "今天老師從辛波絲卡〈寫履歷表〉這篇文章內容進行回顧週三同學完成的課程上活動，接著補充說明和解釋文章的內容讓學生能夠了解對作者對於履歷表所表達的看法，此外對履歷表和能力強項卡進行比較，也說明在履歷表上會有哪些資訊無法呈現的，最後老師讓學開始動手寫作引導句。在下一堂課開始以自我介紹的心智圖呈現方式以展示影片和歷年範例讓學生進行製作。"
      },
      activities: [
        {
          title: "活動一: 創作活動反履歷表",
          content: "當說明和講解辛波絲卡〈寫履歷表〉課程內容後，老師讓每個同學進行創作活動：反履歷表。讓每位學生以「我曾在_____學會了_____、別人看不見但我珍惜的是_____、我希望被記住的不是頭銜，而是_____」的句型進行創作。創作後，老師請四組上台進行分享並讓學生對自己填寫的內容向老師說明。",
          observation: "在同學上台分享內容時，大家的想法真的很棒。我最喜歡的組員填寫內容是：「我曾在夢想中學會放棄、別人看不見但我珍惜的是自由、我希望被記住的不是頭銜，而是開心的一面。」我很意外大一的同學，居然能有這樣的想法對於夢想或理想目標，我也認同有時候需要學會如何放棄。給自己一些時間休息或做其他事情，因為太追求完美反而會讓自己過得很辛苦，事後也可能嚴重影響身心。有時候，學會「好好放棄」其實也是一件好事，因為在追求的過程中，那份努力本身就已經證明了自己很棒了。"
        },
        {
          title: "活動二: 自我介紹心智圖創作",
          content: "老師展示了如何開始製作一個自我介紹的心智圖，並讓學生親自繪製與創作屬於自己的自我介紹心智圖。透過前幾週老師帶領學生認識自己的強項，以及履歷表中可撰寫內容，讓學生在這次活動中能從多方向思考與發想，進而繪製出展現自我的心智圖。",
          observation: "老師還在講解過程有很多學生已開始對心智圖的中心點來繪製，多樂同學在繪畫很強，大家已經想好自己要的人物。"
        }
      ]
    },
    7: {
      title: "第七週: 創意履歷表-心智圖",
      photos: [
        {
          src: "img/class1/W7-1.jpg",
          caption: "同學在課本繪製心智圖"
        },
        {
          src: "img/class1/W7-2.jpg",
          caption: "同學完成作品進行佈展"
        },
        {
          src: "img/class1/W7-3.jpg",
          caption: "同學在創作履歷表展活動進行看展和互評。"
        },
        {
          src: "img/class1/W7-4.jpg",
          caption: "老師開問卷結果對同學們說明大家的回覆"
        }
      ],
      record: {
        summary: "課程延續上週的創作履歷表，讓同學繼續在課堂上進行自我介紹心智圖的創作，同時針對同學的作品給予建議與更改方向。在課程結束前，同學們會進行佈展、讓同學進行投票互評自己最喜歡的作品，最後再展示同學們的互評結果與心得回饋。"
      },
      activities: [
        {
          title: "活動一: 自我介紹心智圖創作",
          content: "接續上週的活動讓同學進行創作和補強更正作品，在這階段大家作品內容上已經有個基本主體框架。老師再次強調繪製的要求和注意事項：文字要在線上，至少要有三層，各區以不同顏色區分，和寫自己班級組別和姓名。",
          observation: "多樂班級的每位同學作品都很獨特，在主體繪畫方面、每位同學繪畫風格很獨特有自創少女風格人物，可愛角色與漫畫人物，還有一位同學和我分享他喜歡畫黑暗奇幻風格化的人物，大家的繪畫能力真的很強。在心智圖內容方面，有兩位同學把心智圖內容寫成一句段落式的說明，這時需要提醒同學以關鍵字呈現內容。其次是階層部分不夠，有部分同學的心智圖只有兩個階層。這次也遇到特別的情況：有部分同學以印刷方式繳交作業，因為目前觀察到在多樂班或其他視覺相關班級中，大家都很常使用 iPad 和繪圖板軟體進行創作。"
        },
        {
          title: "活動二: 自我介紹心智圖創作(看展和互評)",
          content: "在這活動同學們會進行看展，每位同學會有三的點點貼紙，要投票給三位同學的作品、同時要為這三個作品撰寫喜歡的理由、最後對於這次活動寫出自己的感想。",
          observation: "在觀展過程中，大家都很認真地欣賞每一件作品，仔細挑選自己想投票的對象。最容易吸引大家目光的部分是作品的主視覺，其次是心智圖上的內容。透過這次活動，我發現同學們也更認識班上彼此，甚至能找到同好或喜歡的畫風。整體來看，班級的氣氛變得更好，大家在投票時也願意主動互動交流。在投票過程中發生了許多有趣的情況：有些同學害羞會以自己組員投票、有同學因為只有三個投票點數覺得太少投票過程會很猶豫不決、有同學身下最後一票不知道要投給誰，最後這位同學決定投給自己好了。"
        }
      ]
    },
    8: {
      title: "第八週: 妙語說書人",
      photos: [
        {
          src: "img/class1/W8-1.jpg",
          caption: "老師講解遊戲運作方式和規則"
        },
        {
          src: "img/class1/W8-2.jpg",
          caption: "大組正在進行遊戲中"
        },
        {
          src: "img/class1/W8-3.jpg",
          caption: "同學在黑板上登記分數"
        },
        {
          src: "img/class1/W8-4.jpg",
          caption: "各組在篩選自己喜歡的卡牌，進行故事創作"
        }
      ],
      record: {
        summary: "今天的課程讓同學們進行「妙語說書人」桌遊，以兩組以上合併進行遊戲。透過說書人遊戲，讓同學能發揮想像力，描述並說明卡片上的圖像。遊戲結束後，各組會分享最有意思的兩張正確卡與誘答卡，並寫出說書人的題目及分享遊戲中的技巧。最後，各組成員選出一張卡，全組一起進行創作接龍故事。"
      },
      activities: [
        {
          title: "活動一: 妙語說書人",
          content: "分成兩組方式進行遊戲，每組人數至少六人以上。在遊戲開始前安排位置後，老師會開始講解遊戲中規則和如何進行，在遊戲計分規格老師有簡化過。在各組進行遊戲時，我和老師會進行觀察看每一組進行情況。",
          observation: "大家在遊戲中進行很順利！有一組卡在計分階段，這時有組員舉手我來進行協助和說明。此外比較晚到的同學有一名，我來講解後同學也很順利的玩。在第五,六組有一位同學要當說書人，老師讓我說明代替同學選一張並開始說書和投票，再下一場我有注意到，這位同學沒有與其他同學進行玩，反而只玩手機，後來我來詢問情況同學沒有回應只點頭。"
        },
        {
          title: "活動二: 遊戲分享與討論",
          content: "第一任務遊戲結束時會讓同學上台登記大組的成員中，第一名人分數最高，因此讓同學選出一組排兩張在玩過程最有意思的並把說書人的題目傳到群組上。第二任務每位同學分享寫上自己在遊戲中怎麼應用隱喻才能讓別人猜不出來，說明誘答是否成功？",
          observation: "在第一任務回應時，大家在取說書人的題目很有創意滿有趣，有些網路用語或詞我自己也不曉得例如：福瑞，和滿有趣一些題目像；阿努比斯的審判，實打實，jojo的奇幻冒險反派。第二任務回應誘答技巧整體每一組會覺得可以用一些抽象的描述和說書方式來騙別人，有的認為成功是靠運氣，但大多數都成功。有些組別覺得玩資訊差也很有用但他們沒有成功過。"
        },
        {
          title: "活動三: 故事接龍",
          content: "老師會讓各組每個人選出自己喜歡的卡牌，每個人會用這張卡創作故事來接龍到其他人故事，當學生們排序好卡牌後，各組會進行故事創作。",
          observation: "各組在故事創作上大家都很認真的撰寫整組故事接龍，我個人覺得第1,11,12這大組故事也寫得很好很有想像力，這故事比北極熊還要冷還有外太空兔子，很驚訝居然是故事中的故事。"
        }
      ]
    },
    9: {
      title: "第九週: 生命書寫四路徑-氣味、那些年我們一起回憶",
      photos: [
        {
          src: "img/class1/W9-1.jpg",
          caption: "老師講解今天課程要上的楊照<氣味>。"
        },
        {
          src: "img/class1/W9-2.jpg",
          caption: "組員進行閱讀和討論楊照<氣味>這篇故事時序。"
        },
        {
          src: "img/class1/W9-3.jpg",
          caption: "組員代表上台說明自己答案和講故事的細部內容。"
        },
        {
          src: "img/class1/W9-4.jpg",
          caption: "組員在那些年我們一起回憶活動繪製感官回憶心智圖"
        }
      ],
      record: {
        summary: "這週次課程談到感官讓人們會容易引起回憶這件事，透過楊照<氣味>這裡面的故事，老師講解完文章後會讓學生進行閱讀並分組討論文章的故事時序，最後讓每一組上台講解故事分享答案。當了解人的感官會讓我們更容易回憶後老師讓每一組進行繪製心智圖關於各組每成員回憶的感官故事那些年的回憶。"
      },
      activities: [
        {
          title: "活動一: 楊照<氣味>故事時序整理",
          content: "在進行活動前老師講解楊照<氣味>這篇文說明的內容和作者如何透過感官想起故事、在文章說明過程，老師會讓學生透過本文判斷本文作者的回憶做過事是否道德在把教官推入荷花池這件事，也證明透過嗅覺無論是否道德，她聞到這味道這時會讓他回憶這件事情。在活動內，會有12段故事讓同學依序排列事情發生的順序。每一組會一起討論，在作業紙本上撰寫號碼。接下來會讓每一組指派一位代表上台講自己組員的答案。",
          observation: "第一上台組會卡在故事說明部分，同學未把握好故事裡面的細節內容。但在作答故事時序時都不會有錯誤。大家上台有點害羞不太敢面對台下的同學，有一部分組別像第四組同學在說明故事表現得很好！還特別兩人一起上台說明。此外因在期中考週，我看到好幾位同學正在看題庫準備明天的考試項目，也許這原因讓大家在課堂中專心度還不夠。"
        },
        {
          title: "活動二: 感官故事那些年我們一起回憶",
          content: "在這活動每一組同學會完成一個感官故事心智圖，在製作上老師給同學兩個方向製作，第一方向選定單一時期來寫感官回憶，第二方向是選擇單一感官來寫那時期的回憶。製作規則與心智圖呈現方式一樣，文字要在線上，組員裡面提供的故事關鍵字會標註自己的名字。",
          observation: "大部分組別選擇第一方向來製作感官故事回憶的作品，大家在執行上不遇到太大的困難。在同學們進行活動過程大家感覺滿喜歡，特別在彼此回想自己的回憶有些覺得很搞笑的回憶，有些回憶讓每個人都有共鳴，每個組員氣氛上好的很多。在作品方面，因為是多樂同學不需多說，作品視覺繪製上水準很高。關鍵字上也有很多故事對我自己也有同感，也稍微回憶自己國小國中時期，感官上的回憶真的令人難忘。"
        }
      ]
    },
    10: {
      title: "第十週: oh! Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
      photos: [
        {
          src: "img/class1/W10-1.jpg",
          caption: "同學們正在進行投票，把貼紙貼到感官故事心智圖上有趣的故事。"
        },
        {
          src: "img/class1/W10-2.jpg",
          caption: "學生們分享被投票的感官故事心智圖回憶。"
        },
        {
          src: "img/class1/W10-3.jpg",
          caption: "學生在感官地圖活動撰寫200個字關於自己印象深刻的回憶故事。"
        },
        {
          src: "img/class1/W10-4.jpg",
          caption: "觀看完關於憂鬱症研究影片學生寫影片的重點。"
        }
      ],
      record: {
        summary: "延續上一周的課程，老師讓同學進行看展投票到有趣和喜歡的心智圖上的感官故事，接著老師會對本班被投票的人進行分享他們的故事回憶，最後讓學生對自己回憶最深刻故事事件寫成200個字的回憶。第二節進入新課程單元：【親愛的我、oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖】，老師讓學生觀看憂鬱影片並讓學生上台寫影片中內容重點，當了解憂鬱症相關後，老師帶領學生觀看這單元的主角，透過本人紀錄片，最後讓學生閱讀課文把內文的事件整理成心智圖。"
      },
      activities: [
        {
          title: "活動一: 感官故事心智圖觀賞和分享",
          content: "延續上一周的課程，老師讓同學進行看展，每個人手上會有兩個點投票到喜歡的心智圖上的故事，老師會分批讓每一組進行觀賞和投票、接著我會拍照同學投票好的照片上傳到班群，讓老師進行播放，老師會選擇本班被投票的故事來讓各組分享故事細節的給大家領聽。",
          observation: "大家選擇故事都跳選很有趨和搞笑事情，大家的國高中也太有趣了。例如：綠色漱口水，更誇張是有人把廁所門拆下來。在這活動每個同學積極地參加，很樂觀地分享自己的回憶給大家聽，也許透過這活動可能每個同學之間會有更多之間有趣事情可以交流，這活動也會讓大一生同學可以有更多機認識自己班上同學。"
        },
        {
          title: "活動二: 感官地圖",
          content: "在這活動老師讓同學針對自己印象深刻事件進行撰寫至少200個字的回憶。這是四個路徑其中一部分讓同學可以進行發展成未來可參考的1000生命故事。",
          observation: "大家在進行撰寫大家都寫好寫滿超過或剛好到200個字，很驚訝得有幾組都寫超過需要多加三張紙本、有部分同學只會應付今天課程把當天的事件撰寫到自己作業上。有部分同學很認真寫到快下課，這幾位在未來的期末1000生命故事完成能力上感覺不會有帶大的問題。"
        },
        {
          title: "活動三: 憂鬱症研究影片觀看，重點整理",
          content: "在整備上oh!Dear me 250天憂鬱症紀實情緒年史這單元，在簡報講解外，老師播放關於憂鬱症研究影片讓學生對憂鬱症的相關內容了解，為了確保大家專心看，老師指派任務讓同學記住影片中的關鍵內容並以各組上台寫。",
          observation: ""
        },
        {
          title: "活動四: 憂鬱症紀實情緒年史紀錄片，心智圖整理",
          content: "當學生了解關於憂鬱症相關研究後，老師會進行說明單元課程裡面的人物（過去得到憂鬱症患者的250天記錄）。然後讓學生觀看內文人物的紀錄片。最後老師會讓學生進行閱讀文本，學生在組員分配進行把文本裡面的事件整理成心智圖。",
          observation: "大家在觀看影片時很認真，關於憂鬱症相關重點每一組都有抓好。在看紀錄片，這紀錄有點沉悶有關文本裡面的人面對憂鬱症和過程的感受和分享關於她。大家觀看時很專心，看到一個人訪談大家看起來對這紀錄片很有感有同理或為一個人而難過。"
        }
      ]
    },
    11: {
      title: "第十一週: 專案演講情緒照顧_自我照顧",
      photos: [
        {
          src: "img/class1/W11-1.jpg",
          caption: "講師正在講解關於照顧身心的! 打造幸福的能量花園--情緒照護的議題"
        },
        {
          src: "img/class1/W11-2.jpg",
          caption: "同學正在撰寫七項對自己是很重要的。"
        },
        {
          src: "img/class1/W11-3.jpg",
          caption: "同學正在閉上眼睛五感靜觀練習 。"
        },
        {
          src: "img/class1/W11-4.jpg",
          caption: "同學們正在選出喜歡的裝飾來放入心靜瓶。"
        }
      ],
      record: {
        summary: "今天課程邀請一位講師任蕙茹講師演講關於如何情緒照顧_自我照顧主題，演講過程講師除了說明一個人身心相關敘述，老師也讓同學觀看透過科技等方法來改善長者憂鬱症。當了解演講背景後講師帶學生進行寫出自己七個能讓自己平或滿足的最重要事件人物等等，接者依序的刪除自己寫出每個重要東西一直到剩下最後一個，因此讓每位同學說出自己留下最後一個最重要的讓老師統計下來。接下來講師說明相關大腦研究文獻容易收到負面思想，說明研究中的狗狗實驗案例講解，最後帶領學生們進行放鬆紓壓技巧讓同學如何透過呼吸和人的五感靜觀練習，課程後面讓同學製作屬於自己的靜心瓶。"
      },
      activities: [
        {
          title: "活動一: 感官故事心智圖觀賞和分享(演講與價值觀探索)",
          content: "在活動的開始講師演講關於情緒照顧背景等相關議題和讓同學觀看目前的在科技上的應用例子：如何透過VR虛擬3D技術來讓長者擺脫憂鬱症疾病，活動過程老師會讓學生寫下對自己會滿足或平心的七項對自己重要。在完成撰寫後，到第二階段大家要對自己寫下的內容刪除四個，在第三階段老師在讓同學刪除兩個項目留下最後一個自己覺得最重要的。",
          observation: "在開始寫的階段，有部分同學還不清楚能列出哪七個項目能對於自己會滿足或平靜或最重要的事件，我有建議同學不要想太難。在刪除過程有些同學任為七個是最重要所以都不刪除，在進行每一位同學表達自己留下來最後一個過程，老師統計後發現大多數同學以家人和親人是最重要的，其次是金錢，快樂和健康。如果是我我也會選擇親人和家人這選項，因為在人生當中他們是個從小陪伴到大的人。"
        },
        {
          title: "活動二: 五感靜觀練習",
          content: "在這活動講師會帶領學生了解人類為何大腦會偏好負向思考，而正向思考需要透過一種經歷的練習所造成的，老師也講解一個狗狗上的實驗從實驗可以知道人只要不放棄就可以從質得無助到質得樂觀這轉念，接者老師也讓學生觀看一些常常聽的負面的內容影片。在要進入五感靜觀練習老師在面前示範給同學要說怎麼口號，和如何慢慢的靜下來。",
          observation: "在影片播放內容大家很有感，其實人負面專狀態下會無意的講出傷害親人的話，影片中提醒我們在對家人或親友對話時有時候簡單的一些不好聽的話也讓他們得到不少的受傷。在五感靜觀練習，他家有好好的執行，有些可能維持不久狀態，有些同學有練習到最後。"
        },
        {
          title: "活動三: 製作屬於自己的靜心瓶",
          content: "同學會製作自己靜心瓶，大家會開始選擇自已喜歡的裝飾品。這活動大家作品很多獨特的靜心瓶，有的會以純金色搭配黃色的牛寧片裝飾，有的會有自己英文字母在靜心瓶裡面。完成作品每位同學很喜歡自己親手作出的作品，而且同學很創意會使用燈來照亮作品。",
          observation: ""
        }
      ]
    },
    12: {
      title: "第十二週: oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
      photos: [
        {
          src: "img/class1/W12-1.jpg",
          caption: "老師播放一個關於憂鬱症感受的歌"
        },
        {
          src: "img/class1/W12-2.jpg",
          caption: "同學正在繪製情緒地圖"
        },
        {
          src: "img/class1/W12-3.jpg",
          caption: "同學在選擇兩張情緒卡"
        },
        {
          src: "img/class1/W12-4.jpg",
          caption: "第一組同學正在撰寫情緒200個字"
        }
      ],
      record: {
        summary: "接續第十週oh!Dear me 250天憂鬱症紀實情緒年史和第十一週的演講關情緒照顧、自我照顧的演講，課程繼續到文本的細部內容，老師會讓學生觀看關於情緒方面的演講影片和領聽有關於憂鬱症歌。其次讓學生寫出自己過去重要事情、選擇對自己很有感的情緒卡最後對一件重要過去事情撰寫200個字。"
      },
      activities: [
        {
          title: "活動一: 情緒地圖",
          content: "在這活動執行前老師帶入學生更深入了解關於情緒的議題，讓學生瞭解人們怎麼認識情緒和憂鬱症人跟一般人感受到外在世界的差異，老師也播放演講和歌。在情緒地圖上學生會以x軸為時間線，y軸為情緒強烈負面和正面的經驗，讓學生進行寫出對自己5到8件重要生命故事事件，大家時間軸會以過去的範圍如小學國中高中等年齡回想自己在當下回憶的情緒和事件。",
          observation: "大家在課堂中想出過去太久的事情有時候會很困難，但在這課程設計上也許在強烈的正面負面事件會讓人們記得很深刻。大家在情緒地圖繪製上和撰寫內容各式各樣都有，有很多正面一個負面，也有正面負面事件記得很深。"
        },
        {
          title: "活動二: 情緒地圖抽情緒卡，選一件是撰寫內容",
          content: "在延續第一活動學生們會進行抽情緒卡，選擇兩張可能對自己目前的感受相同或自己有興趣的卡片，接著學生會觀看卡片上描寫的情緒有哪些對剛剛完成情緒地圖上的事件很相似很有感。最後學生會選在情緒地圖選擇一個很有感會對自己印象很深刻的事件的寫出200個字，以四個問題回答，當時發生甚麼？，我的感覺是甚麼？，我怎麼樣的進行撰寫或同學自行描述該事件的發生和當下情緒。",
          observation: "同學們在撰寫過程遇到最大問題有些細節內容無法敘述或太久而忘，但有部分同學還是會有最有印象深刻重要事件撰寫，情緒卡在這次撰寫也很重要也是一種輔助同學們聯想到情緒地圖上的當時的情緒情況。"
        }
      ]
    },
    13: {
        title: "第十三週: 因為我植得—園藝治療與自我價值探索",
        photos: [
          {
            src: "img/class1/W13-1.jpg",
            caption: "專家演講：因為我植得，園藝治療"
          },
          {
            src: "img/class1/W13-2.jpg",
            caption: "閱讀《達利B的旅程》探索自我特質"
          },
          {
            src: "img/class1/W13-3.jpg",
            caption: "進行愛之語測驗與特質卡轉念練習"
          },
          {
            src: "img/class1/W13-4.jpg",
            caption: "同學專心製作療癒水苔球"
          }
        ],
    record: {
      summary: "第十三週課程以專家演講「因為我植得」為主題，在今天課程會邀請專家老師帶學生們進行演講，關於「因為值得，值得的園藝治療」。<br>活動中老師會讓學生進行各種活動，讓學生可以在這些活動中探索自我價值，找出自己的特質和在不同關係中最喜歡、最渴望的表達愛，以及自己希望別人怎麼對待自己是最舒服的。<br>最後老師帶學生製作水苔球，讓學生可以透過植物來療癒自己，讓它們在一年四季成為我們最好的陪伴。"
    },
    activities: [
      {
        title: "活動一: 閱讀《達利B的旅程》與自我對話",
        content: "在這活動老師會讓每位學生閱讀投影上的小說，關於動物之間的溝通。故事裡面是動物之間詢問自己是什麼動物、是什麼的角色，動物們會是如何尋找自己是誰，主要尋找自我，也因為兔子的優異特質（大腳）讓他拯救了兔子們並成為他們眼中的英雄。<br><br>完成閱讀後，老師讓學生進行回答問題:<br>1.自我探索與認同：成長過程面對自我存在的疑惑？思考自己的特質和喜好?<br>2.自我探問，我是誰? 我喜歡什麼?<br><br>最後同學們需要寫出自己的三個特質（正向特質）。讓學生可以思考自己目前具備哪些特質，是在與人互動方面或道德上有關的正向特質。",
        reflection: "我最印象深刻是關於兔子的劇情，因為兔子遇到某些危機的動物時，那動物對兔子說：我會吃兔子，但兔子反而疑問的說自己是兔子嗎？後面透過一些說服，說自己大腳所以不可能是兔子，反而因為這件事兔子成為了兔子們的英雄。<br>在特質表我自己覺得會列為：勇敢，活潑，開朗這三個特質。",
        observation: "透過讓大家每個人閱讀方式，大家可以更容易專心聆聽其他同學的發言。在了解《達利B的旅程》故事後，學生們在探索自己過程也許更容易。在回答問題方面，對於了解自己有什麼特質，有同學不知自己會有哪些特質，但老師有提供特質表讓同學好寫點。"
      },
      {
        title: "活動二: 特質轉念與愛的五種語言",
        content: "老師會給學生看特質卡片，對每個特質上說明。此外也讓學生思考如何把負面特質說成正面的，例如：「你很依賴對方」，依賴是有帶點負面形容，如果換成正面方式可以說：「你對對方很信任」。<br><br>另一個活動是老師會讓學生觀看五種表達愛的方式：<br>1.肯定的語句<br>2.肢體的接觸<br>3.送禮物<br>4.服務的行動<br>5.精心時刻<br><br>讓學生選擇前三個最喜歡被別人或親人的表達愛方式。其次學生會進行測驗30題的愛之語線上測驗，最後可以看出在這五種表達愛方式的排名，同時可以對比剛剛在紙本上寫的三個最喜歡是否相同。",
        reflection: "在要把負面特質說成正面的有點困難，我想了有點久才認為對於「依賴對方」這特質，說成因為對他們有信任才會有依賴的事情。<br>老師在演講有說到人類腦子出生就帶有負面思想方向，要正面需要累積要練習。在要把負面特質說成正面的有點困難，我想了有點久才認為對於依賴對方這特質，說成因為對他們有信任才會有依賴的是情。老師在演講有說到人類腦子出生就帶有負面思想方向，要正面需要累積要練習。"
      },
      {
        title: "活動三: 製作水苔球",
        content: "最後大家在活動上會進行製作水苔球，每個人可以選自己喜歡的植物來製作。每個人可以選擇喜歡植物，此外老師也準備小裝飾可以插在水苔球上。",
        observation: "大家在製作過程很用心觀看老師播放的教學影片，因為是有動手實作，大家製作過程有很多同學需要幫忙，大家很專心地完成自己的產品。<br>最後下課我感覺每個人都很開心，因為沒想到在這門課可以製作水苔球，並放在自己房間可以陪伴自己過日子。"
      }
    ]
  },
    14: {
      title: "第十四週: 生命書寫四路徑--生命圖象 生命圖象創作",
      photos: [
        {
          src: "img/class1/W14-1.jpg",
          caption: "老師展示歷年學長姊的生命圖像。"
        },
        {
          src: "img/class1/W14-2.jpg",
          caption: "同學正在繪製生命圖像草稿，正在上色。"
        },
        {
          src: "img/class1/W14-3.jpg",
          caption: "同學以ig畫面和彩色泡泡繪製生命圖像。"
        },
        {
          src: "img/class1/W14-4.jpg",
          caption: "同學以複雜的畫面繪製和黑暗的顏色來繪製生命圖像"
        }
      ],
      record: {
        summary: "第十四的課程關於生命圖像創作活動，在課堂上老師會說明生命圖像的創作方式以及展示歷年的學長姐們的生命圖像作品等作品。最後同學們需要填寫200個字創作說明。"
      },
      activities: [
        {
          title: "活動一: 生命圖像創作",
          content: "在創作前老師展示學長姐不同的創作作品以及說明如何創作自己的生命圖像，同學們會為自己思考我生命像什麼並使用一個物品，動物或人物，風景等等來繪製自己生命圖像，此外在圖像上要寫出七到八件關於自己生命中的重要的正面和負面事件。<br><br>  在歷年學長姊作品上有不一樣的創作想法，有學長把自己生命繪製如鋼琴一樣，黑色的鍵學長標上自己過去遇到不開心事件，白色鍵表示歡樂事件等等，如：考到好大學，第一次出國。也有人把人生如漢堡一樣，漢堡不同層的漢堡上表示不同事件，自己最不喜歡吃的（番茄）會標上負面事件。",
          observation: "在同學開始想題材中，大家會遇到困難不知道要繪製甚麼。也有部分同學很快就想到要畫甚麼生命圖像，如：有同學把生命繪製成ig版面，周圍是多彩的泡泡來表達自己每件重要事情，有同學繪製一個女生人物，上面正在飛行的流星是他人生的各個事件。<br>在繪製過程中，大家都很認真在完成自己的作品，並且有些同學會使用不同的顏色來表達自己生命中的正面和負面事件。<br>此外也有一組男同學繪製很簡略，一個臉部只有嘴巴，同學以微笑和難過的嘴型來形容自己在生命中的快樂或難過的事件，也有同學以自己最愛的小鼠來繪製成自己人生。最特別是在第十三組有一位女同學用比較偏黑暗的色彩和複雜的構圖來繪製自己的生命圖像因為作品未完成，我滿期待的。"
        },
        {
          title: "活動二: 生命圖像創作說明200字",
          content: "如果同學完成作品後，會需要填寫200個字，主要會以開場是:我生命就像...，我的生命彷彿像是...。人生就像…,十八歲的我就像…。",
          observation: "因為每個同學繪製的速度有所不同，所以大部分同學會下週繳交作業包含創作說明。同學創作過程最花時間是想代表自己人生物體和開始繪製草稿。"
        }
      ]
    },
    15: {
      title: "第十五週: 物的聯想 (紀念品九宮格) ",
      photos: [
        {
          src: "img/class1/W15-1.jpg",
          caption: "老師說明在九宮格上呈現哪些內容"
        },
        {
          src: "img/class1/W15-2.jpg",
          caption: "同學在九宮格寫的關鍵內容。"
        },
        {
          src: "img/class1/W15-3.jpg",
          caption: "同學正在寫200個字關於紀念品。"
        },
        {
          src: "img/class1/W15-4.jpg",
          caption: "同學以複雜的畫面繪製和黑暗的顏色來繪製生命圖像老師提前說明和展示學長的1000個字期末作業。"
        }
      ],
      record: {
        summary: "第十五週課程前幾分鐘，老師和我幫大家檢討生命圖像作品製作進度，完成後我們進入新的主題關於：物的聯想，老師講解如何透過九宮格方式來描述說明自己的重要物品和紀念品並在課堂上讓同學聯想紀念品的相關事件。"
      },
      activities: [
        {
          title: "活動一: 紀念品九宮格",
          content: "在進入課程老師說明關於生命書寫的的路徑之二，關於我的紀念品。說明學長姐們如何透過紀念品來聯想自己收到紀念品的相關事件。<br><br>因此老師教同學透過九宮格方式來描述自己的紀念品，紀念品會放在九宮格的正中央，接者以描述物，人，事，影響，時間，意義，感受，地點，在九宮格上寫出相關內容。",
          observation: "在觀察同學製作過程，很多同學在回憶自己紀念品有點慢，大家對於紀念品會有些問題:自己送給自己算是紀念品嗎？、如果是重要物也可以當紀念品嗎？、東西很大可以用剪輯把物品照片貼上作業照片嗎。<br>同學在物聯想互動很積極，老師在課堂上幫大家慢慢回憶自己紀念品時有提問大家大該幾歲拿到第一台手機。大家回應很多，部分都是一般支援打電話給家長的手機，少數是平板。<br>在選擇自己紀念品，有同學很特別他把自己的身分證當自己的紀念品(重要的物品)老師對於這同學選擇認同。"
        },
        {
          title: "活動二: 紀念品九宮格200字",
          content: "如果同學完成九宮格上的內容後，會需要填寫200個字，同學們會描述對於這紀念品的故事回憶，同學們同樣可按照描述物，人，事，影響，時間，意義，感受，地點這些關鍵字來敘述。",
          observation: "因為課程開始前花比較多時間在討論和檢討上週的作業，所以在描述200個字需要點時間。除此之外老師最後也跟大家說明關於期末1000個字要如何開始製作和閱讀給同學聽歷年的作品。"
        }
      ]
    },
    16: {
      title: "第十六週: 生命書寫四路徑 生命圖象、生命圖象創作",
      photos: [
        {
          src: "img/class1/W16-1.jpg",
          caption: "老師在閱讀第一篇短文內容"
        },
        {
          src: "img/class1/W16-2.jpg",
          caption: "同學回答對這篇文是否AI生成"
        },
        {
          src: "img/class1/W16-3.jpg",
          caption: "同學在黑板寫最後兩篇是否AI生成內容。"
        },
        {
          src: "img/class1/W16-4.jpg",
          caption: "老師讓學生觀看歷年的生命圖像再創作影片"
        }
      ],
      record: {
        summary: "第十六週課程主要關注在生命故事和生命故事再創作說明。課程中老師會閱讀三篇短文並在每一篇讓每一組學生判斷是否是AI生成的內容。在下一堂課老師會說明生命圖像再創作的製作方式，展示歷年學長姐作品，最後讓學生討論選擇以個人或組員方向完成作業。"
      },
      activities: [
        {
          title: "活動一",
          content: "老師閱讀三篇短文讓學生判斷是否由AI生成的內容並讓每一組進行討論，一個人代表回答案。最後老師讓學生針對最後兩篇短文是AI還是人寫的內容。",
          observation: "同學們對於判斷文內是否有AI生成有很多的想法。<br></br>對於第一篇短文童年的回憶，很多同學認為是AI生成，同學回答認為這篇短文用太高級的描述，前面文有逗點，有____這條線等等。<br>對於第二篇難度變高點，這篇說走就走的青春也是由ai生成和人提供提示詞讓AI修改文內跟人寫的一樣。這篇短文同學認為是人寫，因為在文內使用很多白話的口語像：大家都．．．大家的．．．。<br>對於第三篇電子課驚爆瞬間同學真的看不出是ai生成內容了，因為這篇文裡面有包含本專業電機工科才懂。有部分同學認為是AI例如聲音描述有點多餘，而且文內還把小燈爆炸聲音加上「」這符號。<br>老師最後說明就是AI生成，但生成過程有人提供內容和一些提示改寫方式讓AI生成文章越像人寫的內容。"
        },
        {
          title: "活動二",
          content: "老師說明生命圖像再創作(影片)的製作方式同時介紹同學可以下載和使用剪輯軟體來製作影片。作品會以個人和小組方式，讓學生討論並決定，最後老師也讓學生觀摩老師和歷年學長姊的作品。",
          
        }
      ]
    },
    17: {
      title: "第十七週: 生命圖象成果展、生命故事1000字優化",
      photos: [
        {
          src: "img/class1/W17-1.jpg",
          caption: "老師說明加分作業部分"
        },
        {
          src: "img/class1/W17-2.jpg",
          caption: "同學在進行填寫表單找作品。"
        },
        {
          src: "img/class1/W17-3.jpg",
          caption: "團體一起合作找作品答案"
        },
        {
          src: "img/class1/W17-4.jpg",
          caption: "老師在檢討每一位同學的作業"
        }
      ],
      record: {
        summary: "第十七週課程主要讓學生參加生命圖像成果展，讓學生進行填寫表單來配對尋找作品的人是誰，其次學生會投票給三個最喜歡的作品，最後會拍下來三張作品，跟自己作品合照來製作學習單(加分項目)。剩下時間老師開始檢討學生的生命故事1000個字。 "
      },
      activities: [
        {
          title: "活動一",
          content: "生命圖像成果展開始，老師講解活動要怎麼執行，大該說明學生透過表單上的生命敘述的文字來找對應生命圖像作者的作品。此外學生會領取3的點點來貼上自己喜歡的作品。完成後同學要拍下三張最喜歡的作品以及和自己作品合照。",
          observation: "學生在參展過程在作品感覺沒有太大困難，在表單裡會寫該作品的生命圖像的描述，大該閱讀就可以找到作品了!<br></br>大家在這過程有團體一起解題，也有單獨行動的人找作品，不過很快大家就完成表單上內容，不意外大家都得到滿分100分。<br></br>有部分同學晚到，進度會比較慢，但也會有同學做完並分享答案給大家快速填寫並下一步做投票的活動。<br></br>大家在投票會選擇三個喜歡作品來投票而且要至少投一票給別班及作品，多樂本班算是繪製能力最好的大家作品都很有特色."
        },
        {
          title: "活動二",
          content: "老師說明生命圖像再創作(影片)老師開始對每一位同學檢查生命故事1000個字，讓學生知道要改哪裡並在其他日期重新列印繳交紙本。",
          
        }
      ]
    }
},
class2: {
  2: {
    title: "第二週: 讀辛波絲卡〈寫履歷表〉",
    photos: [
      {
        src: "img/class2/W2-1.png",
        caption: "學生在討論選擇能力強項卡"
      },
      {
        src: "img/class2/W2-2.png",
        caption: "各組當老闆提出兩項能力應徵條件"
      },
      {
        src: "img/class2/W2-3.png",
        caption: "老師討論"
      },
      {
        src: "img/class2/W2-4.png",
        caption: "在各組老闆提出能力條件下，各組換位思考當員工時，來選擇最想應徵公司的條件"
      }
    ],
    record: {
      summary: "課程行前活動，因班上同學都約剛滿18，寫到履歷表的幾乎還不多，因此先讓學生了解履歷的呈現，也對履歷上的技能能力有些自我探討的過程，老師讓學生透過大組、卡牌討論，先讓從老闆的角度，再到員工的角度換位思考。"
    },
    activities: [
      {
        title: "活動一",
        content: "課堂中由老師引導學生進行分組討論，先以兩個小組合併為一個大組。各大組需共同討論並選出「本系學生應具備的核心能力」，從能力卡片中挑選出 10 張作為代表。<br><br>完成後，各大組將所選卡片拍照記錄，並與其他大組進行比較；若同一張能力卡在兩個以上大組中重複出現，則於該卡片上累計加 1 分，以呈現全班共識程度。",
        observation: ""
      },
      {
        title: "活動三",
        content: "進入課程核心階段，老師引導學生進行角色轉換思考，請學生設想自身為雇主，思考「若你是老闆，會提出哪些條件來招募員工？」各組針對此題進行討論，並將整理後的條件書寫於黑板上。<br><br>隨後，各組派代表進行說明，分享訂定這些條件的理由與思考脈絡，引導學生進一步反思自身能力與未來職場需求，並促進全班回應與討論。",
        observation: ""
      },
      {
        title: "活動四",
        content: "接續前一活動，老師引導學生轉換為求職者視角，請各組思考「若自己是員工，會選擇哪三家公司的應徵條件？」學生需從前一活動中各組所提出的招募條件中，挑選出最希望應徵的三項。透過此活動，能夠觀察學生對自身職涯期待的取向，以及其認為最符合未來求職需求的職場條件。",
        observation: ""
      }
    ]
  },
  3: {
    title: "第三週: 閱讀辛波絲卡〈寫履歷表〉",
    photos: [
      {
        src: "img/class2/W3-1.png",
        caption: "學生在討論選擇能力強項卡。"
      },
      {
        src: "img/class2/W3-2.png",
        caption: "組員代表上台閱讀和詮釋組別討論的結果。"
      },
      {
        src: "img/class2/W3-3.png",
        caption: "組員代表上台閱讀和詮釋組別討論的結果。"
      },
      {
        src: "img/class2/W3-4.png",
        caption: "各組針對「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」提出一個形容詞，來表達自己對於這段文字的感受。"
      }
    ],
    record: {
      summary: "今天課程老師介紹辛波絲卡〈寫履歷表〉這篇文章，內容呈現了辛波絲卡在那個時代對於撰寫履歷表的看法。老師讓學生閱讀並進行討論，思考如何詮釋內文。在這個活動中，學生能夠說明文本想要表達的意思，同時也能依照自己的看法，說明是否認同作者的觀點。"
    },
    activities: [
      {
        title: "活動一",
        content: "接續上周活動一並將題目改成「已具備的能力」，同樣列出 10 張能力卡。<br><br>接著安排學生簡要填寫問卷，作為對上週「能力強項卡對齊能力」活動的回顧與延伸。透過問卷填寫的過程，引導學生再次回顧先前的活動內容，並整理、書寫自己在學習歷程中所產生的新發現與想法，進一步深化學習反思。",
        observation: "這兩個活動進行時，老師都會透過輕鬆的對談，促進學生思考自己該具備的能力、已具備的能力。<br><br>討論中第五組、第九組表現較活耀。"
      },
      {
        title: "活動二",
        content: "老師先帶領全班完整閱讀文本內容，接著將文章中的句子分配給各組進行討論與詮釋。各組在討論後推派一位同學上台分享成果，說明對該段內容的理解與詮釋方式，同時也鼓勵學生加入個人觀點，使課堂討論更具互動性與多元性。<br><br>上台過程中第一組同學特別緊張，第三組、十二組有把狀態拉起來，後面的同學多能講出自己的想法。",
        observation: "在巡視同學討論的過程中，大部分同學是認為只要解釋本文的意思就好，雖然有幾組有感受到反諷的意味，但沒有想過在台上說出來。"
      },
      {
        title: "活動三",
        content: "各組要對最後一段「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」進行詮釋，老師也針對這一句向各組提問，讓同學表達自己的看法。這句很現實，每組別的同學都能抓住作者想表達的重點。<br><br>其中，第七組同學表現頗好。",
        observation: ""
      }
    ]
  },
  6: {
    title: "第六週: 創意履歷表-心智圖",
    photos: [
      {
        src: "img/class2/W6-1.png",
        caption: "最後履歷進了碎紙機會有什麼感受?"
      },
      {
        src: "img/class2/W6-2.png",
        caption: "同學在課本空白地方手寫作引導句。"
      },
      {
        src: "img/class2/W6-3.png",
        caption: "同學在課堂上觀看心智圖教學"
      },
      {
        src: "img/class2/W6-4.png",
        caption: "同學開始動手繪製自我介紹心智圖"
      }
    ],
    record: {
      summary: "老師以辛波絲卡〈寫履歷表〉一文作為引導，回顧上週同學完成的課堂活動，並進一步補充說明與解析文章內容，協助學生理解作者對「履歷表」所隱含觀點與反思。課堂中也將履歷表與「能力強項卡」進行對照比較，引導學生思考履歷表中哪些個人特質與生命經驗其實難以被完整呈現。<br><br>最後，老師帶領學生實際進行引導句寫作，作為後續創作的起點，並預告下一堂課將以「自我介紹心智圖」的方式進行延伸，透過影片示範與歷年範例，引導學生進行實作與發展。"
    },
    activities: [
      {
        title: "活動一: 創作活動反履歷表",
        content: "說明和講解辛波絲卡〈寫履歷表〉課程內容時，老師詢問同學，最後履歷進了碎紙機會有什麼感受? 15組中有10組有負面形容詞，兩組無感，一組正向形容詞。<br><br>而後老師讓每個同學進行創作活動：反履歷表。讓每位學生以「我曾在_____學會了_____、別人看不見但我珍惜的是_____、我希望被記住的不是頭銜，而是_____」的句型進行創作。創作後，老師請同學進行分享並讓學生對自己填寫的內容向老師說明。",
        observation: "在同學上台分享內容時，可能因為班上男生多，有人的造句是「我曾在賭博中學會了見好就收；別人看不到，但我珍視的是我的荷包。」這類較具趣味的回答。"
      },
      {
        title: "活動二: 自我介紹心智圖創作",
        content: "老師先用影片示範如何開始製作自我介紹心智圖，並引導學生實際動手繪製，創作屬於自己的自我介紹心智圖。結合前幾週課程中對個人強項的探索，以及履歷表可呈現內容的討論，學生在此次活動中能從多元角度進行思考與發想，進一步整理自身特色，並以心智圖形式呈現個人樣貌。",
        observation: ""
      }
    ]
  },
  7: {
    title: "第七週: 創意履歷表-心智圖",
    photos: [
      {
        src: "img/class2/W7-1.png",
        caption: "同學繪製心智圖"
      },
      {
        src: "img/class2/W7-2.png",
        caption: "同學完成作品進行佈展"
      },
      {
        src: "img/class2/W7-3.png",
        caption: "同學在創作履歷表展活動進行看展和互評。"
      },
      {
        src: "img/class2/W7-4.png",
        caption: "老師開問卷結果對同學們說明大家的回覆"
      }
    ],
    record: {
      summary: "本次課程延續上週的「創作履歷表」主題，讓同學於課堂中持續進行自我介紹心智圖的創作與修正。老師在學生創作過程中逐一給予回饋，協助同學釐清內容方向並提出修改建議。課程尾聲安排作品佈展，讓同學進行投票與互評，最後彙整並展示互評結果與學生心得回饋，提升學生觀察與反思能力。"
    },
    activities: [
      {
        title: "活動一：自我介紹心智圖創作",
        content: "延續上週進度，同學持續進行心智圖的創作與補強修正，此階段多數作品已具備基本架構。老師再次說明與提醒繪製規範與注意事項，包括文字需書寫於線條上、心智圖至少須具備三層結構、各區塊以不同顏色區分，並清楚標示班級、組別與姓名，以協助同學完善作品內容與呈現品質。",
        observation: ""
      },
      {
        title: "活動二：自我介紹心智圖創作(看展和互評)",
        content: "在成果展示階段，同學進行作品佈展與看展活動。每位同學可獲得三枚貼紙，投票選出最喜歡的三件作品，並需分別寫下喜歡的理由；同時也引導學生回顧整體創作歷程，完成本次活動的心得感想書寫，促進同儕觀摩與自我反思。",
        observation: ""
      }
    ]
  },
  8: {
    title: "第八週: 妙語說書人",
    photos: [
      {
        src: "img/class2/W8-1.png",
        caption: "老師講解遊戲運作方式和規則"
      },
      {
        src: "img/class2/W8-2.png",
        caption: "大組正在進行遊戲中"
      },
      {
        src: "img/class2/W8-3.png",
        caption: "同學在黑板上登記分數"
      },
      {
        src: "img/class2/W8-4.png",
        caption: "各組在篩選自己喜歡的卡牌，進行故事創作"
      }
    ],
    record: {
      summary: "本次課程安排同學進行桌遊活動「妙語說書人」，以兩組以上合併為一大組進行遊戲。透過說書人的遊戲機制，引導學生發揮想像力，嘗試以不同角度描述卡片圖像，並思考如何在資訊模糊的情況下引導他人猜測。遊戲結束後，各組分享遊戲中最有趣的正確卡與誘答卡，並整理說書人的題目與遊戲技巧；最後，各組選出一張卡牌，全組共同進行故事接龍創作，將遊戲經驗延伸為創作練習。"
    },
    activities: [
      {
        title: "活動一：妙語說書人",
        content: "課堂中將同學分為兩大組進行遊戲，每組人數至少六人以上。遊戲開始前，老師先協助同學安排座位，並講解遊戲規則與進行方式，計分方式則依課程需求進行簡化。各組開始遊戲後，老師與助教一同進行巡視與觀察，了解各組的遊戲進行情況與學生參與狀況。",
        observation: ""
      },
      {
        title: "活動二：任務與反思",
        content: "第一任務：遊戲結束後，請各組派代表上台登記大組內分數最高的同學，並由該組選出兩張在遊戲過程中最有趣的卡牌，將對應的說書人題目分享至群組中。<br><br>第二任務：請每位同學書寫並分享自己在遊戲中如何運用隱喻或描述技巧，讓他人難以正確猜測卡牌，同時反思自己的誘答是否成功。",
        observation: ""
      },
      {
        title: "活動三：故事接龍",
        content: "老師會讓各組每個人選出自己喜歡的卡牌，每個人會用這張卡創作故事來接龍到其他人故事，當學生們排序好卡牌後，各組會進行故事創作。",
        observation: ""
      }
    ]
  },
  9: {
    title: "第九週: 生命書寫四路徑-氣味、那些年我們一起回憶",
    photos: [
      {
        src: "img/class2/W9-1.png",
        caption: "老師講解今天課程要上的楊照<氣味>。"
      },
      {
        src: "img/class2/W9-2.png",
        caption: "組員進行閱讀和討論楊照<氣味>這篇故事時序。"
      },
      {
        src: "img/class2/W9-3.png",
        caption: "組員代表上台說明自己答案和講故事的細部內容。"
      },
      {
        src: "img/class2/W9-4.png",
        caption: "組員在那些年我們一起回憶活動繪製感官回憶心智圖"
      }
    ],
    record: {
      summary: "本週課程以「感官如何喚起記憶」為主題，透過楊照〈氣味〉一文，引導學生理解感官與回憶之間的連結。老師在講解文章內容後，請學生閱讀文本並分組討論故事的時序結構，最後由各組上台說明討論結果並分享答案。在學生理解感官對記憶的影響後，老師進一步安排創作活動，請各組以心智圖形式，整理並呈現組員們與感官相關的回憶故事，將閱讀理解延伸至個人經驗的書寫與分享。"
    },
    activities: [
      {
        title: "活動一: 楊照<氣味>故事時序整理",
        content: "活動開始前，老師先說明〈氣味〉一文的內容，並引導學生理解作者如何透過嗅覺回憶過往事件。在文本解析過程中，老師也引導學生討論文中「將教官推入荷花池」的事件是否具有道德爭議，進一步說明無論事件本身是否符合道德判斷，氣味仍會觸發回憶，凸顯感官記憶的強烈特性。<br><br>活動進行時，老師提供十二段文本內容，請各組依故事發生的先後順序進行排列，並將答案填寫於作業紙上。討論過程中，老師與助教會巡視各組作答情形，若發現錯誤，則適時給予引導與修正方向。<br><br>完成排序後，各組指派一位代表上台說明討論結果，例如說明故事的第一個事件為哪一句，並依序以說故事的方式向全班說明文本內容。此部分也呼應上週「妙語說書人」活動，讓學生練習如何將文本內容轉化為口語敘述。",
        observation: ""
      },
      {
        title: "活動二: 感官故事那些年我們一起回憶",
        content: "在第二個活動中，各組需完成一張「感官故事心智圖」。老師提供兩種創作方向供學生選擇：第一為設定單一時期，書寫該時期的感官回憶；第二為選擇單一感官，回憶不同時期的相關經驗。心智圖製作規範與前幾週相同，文字需標註於線條上，且組員提供的故事關鍵字需標示姓名，以利辨識。",
        observation: ""
      }
    ]
  },
  10: {
    title: "第十週: oh! Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
    photos: [
      {
        src: "img/class2/W10-1.png",
        caption: "同學們正在進行投票，把貼紙貼到感官故事心智圖上有趣的故事。"
      },
      {
        src: "img/class2/W10-2.png",
        caption: "學生們分享被投票的感官故事心智圖回憶。"
      },
      {
        src: "img/class2/W10-3.png",
        caption: "學生在感官地圖活動撰寫200個字關於自己印象深刻的回憶故事。"
      },
      {
        src: "img/class2/W10-4.png",
        caption: "觀看完關於憂鬱症研究影片學生寫影片的重點。"
      }
    ],
    record: {
      summary: "延續上一週的課程內容，老師安排學生進行感官故事心智圖的成果觀賞與投票活動。透過看展與投票，引導學生欣賞彼此的作品，並從中選出覺得有趣或特別有共鳴的感官故事。接著，老師針對本班獲得票選的作品進行分享，邀請學生說明自身的回憶內容。課程後段，老師請學生將自己印象最深刻的一則回憶事件，整理並書寫成約 200 字的文字紀錄。<br><br>第二節課進入新的課程單元【親愛的我、oh! Dear me：250 天憂鬱症紀實情緒年史、情緒拼圖】。老師先引導學生觀看與憂鬱症相關的影片，並請學生上台整理影片重點，加深理解。接著介紹本單元的主角，透過當事人的紀錄片讓學生認識其情緒歷程，最後請學生閱讀文本內容，並將事件脈絡整理成心智圖，作為本單元的學習統整。"
    },
    activities: [
      {
        title: "活動一：感官故事心智圖觀賞與分享",
        content: "延續上一週的感官故事心智圖創作成果，老師安排同學進行看展活動。每位同學可獲得兩個投票點，投票給自己喜歡的心智圖故事。老師分批引導各組進行觀賞與投票，助教協助拍攝完成投票後的作品照片並上傳至班級群組，供老師播放展示。老師再挑選本班獲得票選的作品，請各組分享故事細節，讓同學彼此聆聽與交流回憶內容。",
        observation: ""
      },
      {
        title: "活動二：感官地圖書寫",
        content: "在本活動中，老師請學生針對自己印象最深刻的一則事件，撰寫至少 200 字的回憶文字。此活動為課程中四條創作路徑之一，作為未來延伸發展為「1000 字生命故事」的重要素材，引導學生逐步累積個人書寫內容。",
        observation: ""
      },
      {
        title: "活動三：憂鬱症研究影片觀看與重點整理",
        content: "為銜接「oh! Dear me：250 天憂鬱症紀實情緒年史」單元，老師除簡報說明外，也播放與憂鬱症相關的研究影片，協助學生建立基本認知。為提升學生專注度，老師指派任務，請同學記錄影片中的關鍵重點，並由各組派代表上台書寫與整理，促進共同理解與討論。",
        observation: ""
      },
      {
        title: "活動四：憂鬱症紀實情緒年史紀錄片觀賞與心智圖整理",
        content: "在學生具備基礎認知後，老師進一步說明本單元中的核心人物——一位曾罹患憂鬱症、並記錄 250 天情緒歷程的當事者。接著安排學生觀看其紀錄片，並閱讀相關文本內容。最後，學生分組合作，將文本中的事件整理成心智圖，協助梳理情緒變化與事件脈絡，完成本單元的統整學習。",
        observation: ""
      }
    ]
  },
  11: {
    title: "第十一週: 專案演講情緒照顧_自我照顧",
    photos: [
      {
        src: "img/class2/W11-1.png",
        caption: "講師正在講解關於照顧身心的! 打造幸福的能量花園--情緒照護的議題"
      },
      {
        src: "img/class2/W11-2.png",
        caption: "同學正在撰寫七項對自己是很重要的。"
      },
      {
        src: "img/class2/W11-3.png",
        caption: "同學正在閉上眼睛五感靜觀練習 。"
      },
      {
        src: "img/class2/W11-4.png",
        caption: "同學們正在選出喜歡的裝飾來放入心靜瓶。"
      }
    ],
    record: {
      summary: "本次課程邀請任蕙茹講師進行「情緒照顧——自我照顧」主題演講。演講中，講師從身心狀態的關聯切入，說明情緒對心理與生理的影響，並搭配實際案例，讓同學了解如何透過科技輔助（如 VR 虛擬 3D 技術）改善長者憂鬱症的情況。 在建立背景理解後，講師引導學生進行書寫活動，請同學列出七項能讓自己感到平靜或滿足的重要事件、人物或事物，並透過逐步刪減的方式，思考自己真正最重視的核心價值，最後由每位同學分享所留下的一項，並由老師進行統整。<br><br>接續課程，講師說明相關大腦研究，介紹人類大腦較容易受到負面思考影響的原因，並以研究中的動物實驗（狗狗實驗）為例，說明「從習得無助到習得樂觀」的轉變歷程。最後，講師帶領學生進行放鬆紓壓練習，透過呼吸調節與五感靜觀，協助同學實際體驗自我照顧的方法。課程後段則安排學生動手製作屬於自己的靜心瓶，作為情緒安定與覺察的具體媒介。"
    },
    activities: [
      {
        title: "活動一：自我照顧覺察書寫與刪減練習",
        content: "活動開始時，講師先說明情緒照顧的背景與重要性，並播放科技應用的實例影片，介紹如何透過 VR 技術協助長者改善憂鬱情緒。接著請學生書寫七項能讓自己感到平靜或滿足、且對自身而言相當重要的事物。<br><br>完成書寫後，進入第二階段刪減練習，同學需從原先列出的七項中刪除四項；此階段可觀察到部分同學在抉擇時感到猶豫與掙扎。第三階段則再刪除兩項，最終只留下自己認為最重要的一項，並由同學輪流分享，協助大家更清楚覺察自身的核心需求與情感依附。",
        observation: ""
      },
      {
        title: "活動二：五感靜觀與情緒調節練習",
        content: "在本活動中，講師先說明人類大腦偏向負向思考的機制，並強調正向思考需要透過練習逐步養成。透過狗狗實驗的案例，讓學生理解只要不放棄練習，思維模式便有機會從消極轉為積極。<br><br>課程中也播放多段常見的負向語言情境影片，例如責備、否定或傷害性的言語，並對照語句結構改為正向表達，讓學生觀察語言如何影響情緒與他人反應。正式進入五感靜觀練習前，講師先於講台前示範流程與口訣，帶領學生透過呼吸、聽覺、觸覺等方式，逐步安定身心。",
        observation: ""
      },
      {
        title: "活動三：靜心瓶製作",
        content: "課程最後，學生動手製作屬於自己的靜心瓶。同學們自由選擇喜歡的裝飾素材進行設計，作品風格多元且富有個人特色，例如以金色與黃色亮片搭配呈現溫暖感受，或在瓶中加入個人英文名字作為象徵。完成後，多數同學對自己親手製作的靜心瓶感到相當滿意，也有同學發揮創意，搭配燈光效果為作品增添氛圍，使靜心瓶成為兼具情緒照顧與美感的創作成果。",
        observation: ""
      }
    ]
  },
  12: {
    title: "第十二週: oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
    photos: [
      {
        src: "img/class2/W12-1.png",
        caption: "老師播放一個情緒照顧的影片"
      },
      {
        src: "img/class2/W12-2.png",
        caption: "同學正在繪製情緒地圖"
      },
      {
        src: "img/class2/W12-3.png",
        caption: "同學在選擇兩張情緒卡"
      },
      {
        src: "img/class2/W12-4.png",
        caption: "第一組同學正在撰寫情緒200個字"
      }
    ],
    record: {
      summary: "本週課程延續第十週【oh! Dear me：250 天憂鬱症紀實情緒年史】與第十一週「情緒照顧／自我照顧」主題演講內容，進一步聚焦於文本與情緒經驗的細部探討。老師透過播放情緒相關演講影片，並安排學生聆聽與憂鬱症主題相關的歌曲，引導學生以多元感官方式理解情緒議題。課程中，學生需回顧自身的重要生命事件，搭配情緒卡的選擇，最後針對一件對自己特別有感的過去事件，完成約 200 字的情緒書寫。"
    },
    activities: [
      {
        title: "活動一：情緒地圖",
        content: "在活動開始前，老師先帶領學生更深入認識情緒相關議題，說明人們如何覺察情緒，以及憂鬱症患者與一般人在感受外在世界時的差異。課程中搭配演講影片與歌曲，讓學生以不同形式接收與理解情緒內容。<br><br>情緒地圖繪製時，學生以 X 軸作為時間線 、 Y 軸作為情緒強度（由負面至正面） ，回顧並標示 5 至 8 件對自己而言重要的生命事件。時間範圍多從小學、國中、高中等階段進行回想，並標註當下事件與對應的情緒狀態，協助學生整理情緒與生命經驗之間的關聯。",
        observation: ""
      },
      {
        title: "活動二：情緒卡選擇與情緒書寫",
        content: "延續第一個活動，學生進行情緒卡抽取，選擇兩張與自己目前感受相近，或特別引起共鳴的情緒卡。透過閱讀卡片上對情緒的描述，學生進一步對照情緒地圖中所標示的生命事件，找出最有感、最具連結的情緒經驗。<br><br>最後，學生從情緒地圖中選擇一件對自己印象最深刻的事件，撰寫約 200 字的情緒回憶文字。書寫內容以四個引導問題為核心，包括：事件當時發生了什麼、自己的感受是什麼、如何看待當下的情緒，以及事件帶來的影響，引導學生以書寫方式整理與理解自身情緒經驗。",
        observation: ""
      }
    ]
  },
  13: {
    title: "第十三週: 專家演講，因為我植得",
    photos: [
      {
        src: "img/class2/W13-1.png",
        caption: "老師說明這故事背景並讓同學朗讀"
      },
      {
        src: "img/class2/W13-2.png",
        caption: "同學朗讀復原力的文本"
      },
      {
        src: "img/class2/W13-3.png",
        caption: "老師正在說明如何把植物拿出來"
      },
      {
        src: "img/class2/W13-4.png",
        caption: "同學正在製作水苔球"
      }
    ],
    record: {
      summary: "第十三週課程以專家演講為主軸，主題為「因為我值得」，邀請專家講師帶領學生認識「因為值得」的核心概念，並結合園藝治療進行體驗式學習。課程中透過多元活動，引導學生探索自我價值，思考自身特質，以及在不同人際關係中最喜歡、最渴望的愛的表達方式，同時也反思自己希望被他人如何對待，才能感到自在與被理解。課程最後安排水苔球製作，讓學生透過與植物互動，體驗療癒與陪伴的感受，並將自我照顧延伸至日常生活中。"
    },
    activities: [
      {
        title: "活動一：閱讀〈達利 B 的旅程〉",
        content: "活動開始時，老師引導學生閱讀投影上的故事〈達利 B 的旅程〉。故事內容以動物之間的對話為主軸，描述角色在旅程中不斷詢問與探索「我是誰」、「我扮演什麼角色」，藉由動物們的互動呈現自我認同的過程。故事中也提到兔子因為自身獨特的優勢（如大腳的特質），成功拯救夥伴，並成為他人眼中的英雄，象徵每個人都擁有值得被看見的特質。<br><br>閱讀結束後，老師引導學生進行自我反思與書寫，包含以下方向：成長過程中是否曾對自我存在產生疑惑、自身的特質與喜好為何、「我是誰？我喜歡什麼？」的自我探問。最後，學生需寫下三項屬於自己的正向特質，並思考這些特質如何展現在與他人的互動中，或與自身的價值與道德選擇相關。",
        observation: ""
      },
      {
        title: "活動二：特質轉換與愛的表達方式探索",
        content: "在第二個活動中，老師向學生介紹特質卡，逐一說明各項特質的意涵，並引導學生思考如何將原本被視為負面的特質，轉換為較為正向的表達方式。例如，將「過於依賴」重新詮釋為「對他人具有信任感」，協助學生重新看待自身特質。<br><br>接著，老師介紹「五種愛的表達方式」，包括：肯定的語句、肢體接觸、贈送禮物、服務的行動、精心時刻。學生需先在紙本上選出自己最喜歡的前三種被愛的方式，再進行 30 題的「愛之語」線上測驗。測驗結果會呈現五種表達方式的排序，讓學生能對照測驗結果與先前選擇是否一致，進一步理解自己在人際關係中的情感需求。",
        observation: ""
      },
      {
        title: "活動三：水苔球製作（園藝治療體驗）",
        content: "課程最後，學生進行水苔球製作體驗。每位同學可依個人喜好選擇植物進行創作，老師亦準備多樣小型裝飾素材，讓學生自由搭配設計。透過親手製作水苔球，學生不僅體驗到園藝療癒的過程，也將「因為我值得被好好對待」的概念，具體轉化為能長期陪伴自己的植物作品。",
        observation: ""
      }
    ]
  },
  14: {
    title: "第十四週: 生命書寫四路徑--生命圖象 生命圖象創作",
    photos: [
      {
        src: "img/class2/W14-1.png",
        caption: "老師展示歷年學長姊的生命圖像。"
      },
      {
        src: "img/class2/W14-2.png",
        caption: "同學正在繪製生命圖像草稿，正在上色。"
      },
      {
        src: "img/class2/W14-3.png",
        caption: "同學正在繪製生命圖像草稿，正在上色。"
      },
      {
        src: "img/class2/W14-4.png",
        caption: "同學正在繪製生命圖像草稿，正在上色。"
      }
    ],
    record: {
      summary: "第十四週課程以「生命圖像創作」為主題，引導學生透過視覺創作回顧與整理自身生命歷程。課堂中，老師先說明生命圖像的創作概念與表現方式，並展示歷年學長姐的作品作為參考，讓學生理解生命圖像可如何結合象徵、事件與個人經驗。課程最後，學生需完成一段約 200 字的創作說明文字，說明自身作品的發想與意涵。"
    },
    activities: [
      {
        title: "活動一：生命圖像創作",
        content: "在正式創作前，老師先介紹多件學長姐的生命圖像作品，並說明創作時可從「我的生命像什麼？」作為發想起點。學生可自由選擇物品、動物、人物或風景等作為象徵，將其轉化為自己的生命圖像。同時，需在圖像中標示 7 至 8 件生命中的重要事件，包含正面與負面經驗，藉此呈現生命歷程的多樣面向。<br><br>歷屆作品中可見多元的創作方式，例如有學長將生命比喻為鋼琴，以黑鍵標示曾經遭遇的不愉快事件，白鍵則代表快樂與成就，如考上理想的大學或第一次出國；也有學長將人生描繪成漢堡，不同層次象徵不同生命事件，並將自己最不喜歡的食材（如番茄）標註為負面經驗。透過這些範例，引導學生理解生命圖像不僅是描繪事件，更是一種自我詮釋的方式。",
        observation: ""
      },
      {
        title: "活動二：生命圖像創作說明",
        content: "完成圖像創作後，學生需撰寫約 200 字的創作說明文字，作為對作品的補充與詮釋。文字開頭可從以下句型發想，例如：「我的生命就像……」、「我的生命彷彿是……」、「人生就像……」、「十八歲的我就像……」，引導學生說明圖像象徵的意義，以及這些生命事件如何形塑現在的自己。",
        observation: ""
      }
    ]
  }
},
class3: {
        2: {
          title: "第二週: 讀辛波絲卡〈寫履歷表〉",
          photos: [
            {
              src: "img/class3/W2-1.png",
              caption: "學生在討論選擇能力強項卡"
            },
            {
              src: "img/class3/W2-2.png",
              caption: "各組當老闆提出兩項能力應徵條件"
            },
            {
              src: "img/class3/W2-3.png",
              caption: "老師討論"
            },
            {
              src: "img/class3/W2-4.png",
              caption: "在各組老闆提出能力條件下，各組換位思考當員工時，來選擇最想應徵公司的條件"
            }
          ],
          record: {
            summary: "課程行前活動，因班上同學都約剛滿18，寫到履歷表的幾乎還不多，因此先讓學生了解履歷的呈現，也對履歷上的技能能力有些自我探討的過程，老師讓學生透過大組、卡牌討論，先讓從老闆的角度，再到員工的角度換位思考。"
          },
          activities: [
            {
              title: "活動一：核心能力選拔",
              content: "課堂中由老師引導學生進行分組討論，先以兩個小組合併為一個大組。各大組需共同討論並選出「本系學生應具備的核心能力」，從能力卡片中挑選出 10 張作為代表。<br><br>完成後，各大組將所選卡片拍照記錄，並與其他大組進行比較；若同一張能力卡在兩個以上大組中重複出現，則於該卡片上累計加 1 分，以呈現全班共識程度。"
            },
            {
              title: "活動三：雇主視角",
              content: "進入課程核心階段，老師引導學生進行角色轉換思考，請學生設想自身為雇主，思考「若你是老闆，會提出哪些條件來招募員工？」各組針對此題進行討論，並將整理後的條件書寫於黑板上。<br><br>隨後，各組派代表進行說明，分享訂定這些條件的理由與思考脈絡，引導學生進一步反思自身能力與未來職場需求，並促進全班回應與討論。"
            },
            {
              title: "活動四：求職者視角",
              content: "接續前一活動，老師引導學生轉換為求職者視角，請各組思考「若自己是員工，會選擇哪三家公司的應徵條件？」學生需從前一活動中各組所提出的招募條件中，挑選出最希望應徵的三項。透過此活動，能夠觀察學生對自身職涯期待的取向，以及其認為最符合未來求職需求的職場條件。"
            }
          ]
        },
        3: {
          title: "第三週: 閱讀辛波絲卡〈寫履歷表〉",
          photos: [
            {
              src: "img/class3/W3-1.png",
              caption: "學生在討論選擇能力強項卡。"
            },
            {
              src: "img/class3/W3-2.png",
              caption: "組員代表上台閱讀和詮釋組別討論的結果。"
            },
            {
              src: "img/class3/W3-3.png",
              caption: "組員代表上台閱讀和詮釋組別討論的結果。"
            },
            {
              src: "img/class3/W3-4.png",
              caption: "組員代表上台閱讀和詮釋組別討論的結果。"
            }
          ],
          record: {
            summary: "今天課程老師介紹辛波絲卡〈寫履歷表〉這篇文章，內容呈現了辛波絲卡在那個時代對於撰寫履歷表的看法。老師讓學生閱讀並進行討論，思考如何詮釋內文。在這個活動中，學生能夠說明文本想要表達的意思，同時也能依照自己的看法，說明是否認同作者的觀點。"
          },
          activities: [
            {
              title: "活動一：已具備的能力",
              content: "接續上周活動一並將題目改成「已具備的能力」，同樣列出 10 張能力卡。<br><br>接著安排學生簡要填寫問卷，作為對上週「能力強項卡對齊能力」活動的回顧與延伸。透過問卷填寫的過程，引導學生再次回顧先前的活動內容，並整理、書寫自己在學習歷程中所產生的新發現與想法，進一步深化學習反思。",
              observation: "這兩個活動進行時，老師都會透過輕鬆的對談，促進學生思考自己該具備的能力、已具備的能力。討論中第五組、第九組表現較活耀。"
            },
            {
              title: "活動二：文本閱讀與詮釋",
              content: "老師先帶領全班完整閱讀文本內容，接著將文章中的句子分配給各組進行討論與詮釋。各組在討論後推派一位同學上台分享成果，說明對該段內容的理解與詮釋方式，同時也鼓勵學生加入個人觀點，使課堂討論更具互動性與多元性。",
              observation: "在巡視同學討論的過程中，大部分同學是認為只要解釋本文的意思就好，雖然有幾組有感受到反諷的意味，但沒有想過在台上說出來。"
            },
            {
              title: "活動三：結尾詮釋",
              content: "各組要對最後一段「反正，還有什麼好聽的？碎紙機嘈雜的聲音。」進行詮釋，老師也針對這一句向各組提問，讓同學表達自己的看法。這句很現實，每組別的同學都能抓住作者想表達的重點。",
              observation: "其中，第七組同學表現頗好。"
            }
          ]
        },
        4: {
          title: "第四週: 創意履歷表-心智圖",
          photos: [
            {
              src: "img/class3/W4-1.png",
              caption: "同學在課本空白地方手寫作引導句。"
            },
            {
              src: "img/class3/W4-2.png",
              caption: "同學在課本空白地方手寫作引導句。"
            },
            {
              src: "img/class3/W4-3.png",
              caption: "同學在課堂上觀看心智圖教學"
            },
            {
              src: "img/class3/W4-4.png",
              caption: "同學開始動手繪製自我介紹心智圖"
            }
          ],
          record: {
            summary: "老師以辛波絲卡〈寫履歷表〉一文作為引導，回顧上週同學完成的課堂活動，並進一步補充說明與解析文章內容，協助學生理解作者對「履歷表」所隱含觀點與反思。課堂中也將履歷表與「能力強項卡」進行對照比較，引導學生思考履歷表中哪些個人特質與生命經驗其實難以被完整呈現。<br><br>最後，老師帶領學生實際進行引導句寫作，作為後續創作的起點，並預告下一堂課將以「自我介紹心智圖」的方式進行延伸，透過影片示範與歷年範例，引導學生進行實作與發展。"
          },
          activities: [
            {
              title: "活動一：創作活動反履歷表",
              content: "說明和講解辛波絲卡〈寫履歷表〉課程內容時，老師詢問同學，最後履歷進了碎紙機會有什麼感受?<br>而後老師讓每個同學進行創作活動：反履歷表。讓每位學生以「我曾在_____學會了_____、別人看不見但我珍惜的是_____、我希望被記住的不是頭銜，而是_____」的句型進行創作。創作後，老師請同學進行分享並讓學生對自己填寫的內容向老師說明。"
            },
            {
              title: "活動二：自我介紹心智圖創作",
              content: "老師先用影片示範如何開始製作自我介紹心智圖，並引導學生實際動手繪製，創作屬於自己的自我介紹心智圖。結合前幾週課程中對個人強項的探索，以及履歷表可呈現內容的討論，學生在此次活動中能從多元角度進行思考與發想，進一步整理自身特色，並以心智圖形式呈現個人樣貌。"
            }
          ]
        },
        6: {
          title: "第六週: 創意履歷表-心智圖",
          photos: [
            {
              src: "img/class3/W6-1.png",
              caption: "同學繪製心智圖"
            },
            {
              src: "img/class3/W6-2.png",
              caption: "同學完成作品進行佈展"
            },
            {
              src: "img/class3/W6-3.png",
              caption: "同學在創作履歷表展活動進行看展和互評。"
            },
            {
              src: "img/class3/W6-4.png",
              caption: "同學在創作履歷表展活動進行看展和互評。"
            }
          ],
          record: {
            summary: "本次課程延續上週的「創作履歷表」主題，讓同學於課堂中持續進行自我介紹心智圖的創作與修正。老師在學生創作過程中逐一給予回饋，協助同學釐清內容方向並提出修改建議。課程尾聲安排作品佈展，讓同學進行投票與互評，最後彙整並展示互評結果與學生心得回饋，提升學生觀察與反思能力。"
          },
          activities: [
            {
              title: "活動一：自我介紹心智圖創作",
              content: "延續上週進度，同學持續進行心智圖的創作與補強修正，此階段多數作品已具備基本架構。老師再次說明與提醒繪製規範與注意事項，包括文字需書寫於線條上、心智圖至少須具備三層結構、各區塊以不同顏色區分，並清楚標示班級、組別與姓名，以協助同學完善作品內容與呈現品質。"
            },
            {
              title: "活動二：自我介紹心智圖創作(看展和互評)",
              content: "在成果展示階段，同學進行作品佈展與看展活動。每位同學可獲得三枚貼紙，投票選出最喜歡的三件作品，並需分別寫下喜歡的理由；同時也引導學生回顧整體創作歷程，完成本次活動的心得感想書寫，促進同儕觀摩與自我反思。"
            }
          ]
        },
        8: {
          title: "第八週: 妙語說書人",
          photos: [
            {
              src: "img/class3/W8-1.png",
              caption: "老師講解遊戲運作方式和規則"
            },
            {
              src: "img/class3/W8-2.png",
              caption: "大組正在進行遊戲中"
            },
            {
              src: "img/class3/W8-3.png",
              caption: "大組正在進行遊戲中"
            },
            {
              src: "img/class3/W8-4.png",
              caption: "各組在篩選自己喜歡的卡牌，進行故事創作"
            }
          ],
          record: {
            summary: "本次課程安排同學進行桌遊活動「妙語說書人」，以兩組以上合併為一大組進行遊戲。透過說書人的遊戲機制，引導學生發揮想像力，嘗試以不同角度描述卡片圖像，並思考如何在資訊模糊的情況下引導他人猜測。遊戲結束後，各組分享遊戲中最有趣的正確卡與誘答卡，並整理說書人的題目與遊戲技巧；最後，各組選出一張卡牌，全組共同進行故事接龍創作，將遊戲經驗延伸為創作練習。"
          },
          activities: [
            {
              title: "活動一：妙語說書人",
              content: "課堂中將同學分為兩大組進行遊戲，每組人數至少六人以上。遊戲開始前，老師先協助同學安排座位，並講解遊戲規則與進行方式，計分方式則依課程需求進行簡化。各組開始遊戲後，老師與助教一同進行巡視與觀察，了解各組的遊戲進行情況與學生參與狀況。"
            },
            {
              title: "活動二：分享與反思",
              content: "第一任務：遊戲結束後，請各組派代表上台登記大組內分數最高的同學，並由該組選出兩張在遊戲過程中最有趣的卡牌，將對應的說書人題目分享至群組中。<br>第二任務：請每位同學書寫並分享自己在遊戲中如何運用隱喻或描述技巧，讓他人難以正確猜測卡牌，同時反思自己的誘答是否成功。"
            },
            {
              title: "活動三：故事接龍創作",
              content: "老師會讓各組每個人選出自己喜歡的卡牌，每個人會用這張卡創作故事來接龍到其他人故事，當學生們排序好卡牌後，各組會進行故事創作。"
            }
          ]
        },
        9: {
          title: "第九週: 生命書寫四路徑-氣味、那些年我們一起回憶",
          photos: [
            {
              src: "img/class3/W9-1.png",
              caption: "老師講解今天課程要上的楊照<氣味>。"
            },
            {
              src: "img/class3/W9-2.png",
              caption: "組員進行閱讀和討論楊照<氣味>這篇故事時序。"
            },
            {
              src: "img/class3/W9-3.png",
              caption: "組員在那些年我們一起回憶活動繪製感官回憶心智圖"
            },
            {
              src: "img/class3/W9-4.png",
              caption: "組員在那些年我們一起回憶活動繪製感官回憶心智圖"
            }
          ],
          record: {
            summary: "本週課程以「感官如何喚起記憶」為主題，透過楊照〈氣味〉一文，引導學生理解感官與回憶之間的連結。老師在講解文章內容後，請學生閱讀文本並分組討論故事的時序結構，最後由各組上台說明討論結果並分享答案。在學生理解感官對記憶的影響後，老師進一步安排創作活動，請各組以心智圖形式，整理並呈現組員們與感官相關的回憶故事，將閱讀理解延伸至個人經驗的書寫與分享。"
          },
          activities: [
            {
              title: "活動一：楊照<氣味>故事時序整理",
              content: "活動開始前，老師先說明〈氣味〉一文的內容，並引導學生理解作者如何透過嗅覺回憶過往事件。在文本解析過程中，老師也引導學生討論文中「將教官推入荷花池」的事件是否具有道德爭議，進一步說明無論事件本身是否符合道德判斷，氣味仍會觸發回憶，凸顯感官記憶的強烈特性。<br><br>活動進行時，老師提供十二段文本內容，請各組依故事發生的先後順序進行排列，並將答案填寫於作業紙上。討論過程中，老師與助教會巡視各組作答情形，若發現錯誤，則適時給予引導與修正方向。<br><br>完成排序後，各組指派一位代表上台說明討論結果，例如說明故事的第一個事件為哪一句，並依序以說故事的方式向全班說明文本內容。此部分也呼應上週「妙語說書人」活動，讓學生練習如何將文本內容轉化為口語敘述。"
            },
            {
              title: "活動二：感官故事那些年我們一起回憶",
              content: "在第二個活動中，各組需完成一張「感官故事心智圖」。老師提供兩種創作方向供學生選擇：第一為設定單一時期，書寫該時期的感官回憶；第二為選擇單一感官，回憶不同時期的相關經驗。心智圖製作規範與前幾週相同，文字需標註於線條上，且組員提供的故事關鍵字需標示姓名，以利辨識。"
            }
          ]
        },
        10: {
          title: "第十週: oh! Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
          photos: [
            {
              src: "img/class3/W10-1.png",
              caption: "同學們正在進行投票，把貼紙貼到感官故事心智圖上有趣的故事。"
            },
            {
              src: "img/class3/W10-2.png",
              caption: "學生們分享被投票的感官故事心智圖回憶。"
            },
            {
              src: "img/class3/W10-3.png",
              caption: "學生在感官地圖活動撰寫200個字關於自己印象深刻的回憶故事。"
            },
            {
              src: "img/class3/W10-4.png",
              caption: "觀看完關於憂鬱症研究影片學生寫影片的重點。"
            }
          ],
          record: {
            summary: "延續上一週的課程內容，老師安排學生進行感官故事心智圖的成果觀賞與投票活動。透過看展與投票，引導學生欣賞彼此的作品，並從中選出覺得有趣或特別有共鳴的感官故事。接著，老師針對本班獲得票選的作品進行分享，邀請學生說明自身的回憶內容。課程後段，老師請學生將自己印象最深刻的一則回憶事件，整理並書寫成約 200 字的文字紀錄。<br><br>第二節課進入新的課程單元【親愛的我、oh! Dear me：250 天憂鬱症紀實情緒年史、情緒拼圖】。老師先引導學生觀看與憂鬱症相關的影片，並請學生上台整理影片重點，加深理解。接著介紹本單元的主角，透過當事人的紀錄片讓學生認識其情緒歷程，最後請學生閱讀文本內容，並將事件脈絡整理成心智圖，作為本單元的學習統整。"
          },
          activities: [
            {
              title: "活動一：感官故事心智圖觀賞與分享",
              content: "延續上一週的感官故事心智圖創作成果，老師安排同學進行看展活動。每位同學可獲得兩個投票點，投票給自己喜歡的心智圖故事。老師分批引導各組進行觀賞與投票，助教協助拍攝完成投票後的作品照片並上傳至班級群組，供老師播放展示。老師再挑選本班獲得票選的作品，請各組分享故事細節，讓同學彼此聆聽與交流回憶內容。"
            },
            {
              title: "活動二：感官地圖書寫",
              content: "在本活動中，老師請學生針對自己印象最深刻的一則事件，撰寫至少 200 字的回憶文字。此活動為課程中四條創作路徑之一，作為未來延伸發展為「1000 字生命故事」的重要素材，引導學生逐步累積個人書寫內容。"
            },
            {
              title: "活動三：憂鬱症研究影片觀看與重點整理",
              content: "為銜接「oh! Dear me：250 天憂鬱症紀實情緒年史」單元，老師除簡報說明外，也播放與憂鬱症相關的研究影片，協助學生建立基本認知。為提升學生專注度，老師指派任務，請同學記錄影片中的關鍵重點，並由各組派代表上台書寫與整理，促進共同理解與討論。"
            },
            {
              title: "活動四：憂鬱症紀實情緒年史紀錄片觀賞與心智圖整理",
              content: "在學生具備基礎認知後，老師進一步說明本單元中的核心人物——一位曾罹患憂鬱症、並記錄 250 天情緒歷程的當事者。接著安排學生觀看其紀錄片，並閱讀相關文本內容。最後，學生分組合作，將文本中的事件整理成心智圖，協助梳理情緒變化與事件脈絡，完成本單元的統整學習。"
            }
          ]
        },
        11: {
          title: "第十一週: 專案演講情緒照顧_自我照顧",
          photos: [
            {
              src: "img/class3/W11-1.png",
              caption: "講師正在講解關於照顧身心的! 打造幸福的能量花園--情緒照護的議題"
            },
            {
              src: "img/class3/W11-2.png",
              caption: "同學正在撰寫七項對自己是很重要的。"
            },
            {
              src: "img/class3/W11-3.png",
              caption: "同學正觀看情緒的影片"
            },
            {
              src: "img/class3/W11-4.png",
              caption: "同學們正在選出喜歡的裝飾來放入心靜瓶。"
            }
          ],
          record: {
            summary: "本次課程邀請任蕙茹講師進行「情緒照顧——自我照顧」主題演講。演講中，講師從身心狀態的關聯切入，說明情緒對心理與生理的影響，並搭配實際案例，讓同學了解如何透過科技輔助（如 VR 虛擬 3D 技術）改善長者憂鬱症的情況。 在建立背景理解後，講師引導學生進行書寫活動，請同學列出七項能讓自己感到平靜或滿足的重要事件、人物或事物，並透過逐步刪減的方式，思考自己真正最重視的核心價值，最後由每位同學分享所留下的一項，並由老師進行統整。<br><br>接續課程，講師說明相關大腦研究，介紹人類大腦較容易受到負面思考影響的原因，並以研究中的動物實驗（狗狗實驗）為例，說明「從習得無助到習得樂觀」的轉變歷程。最後，講師帶領學生進行放鬆紓壓練習，透過呼吸調節與五感靜觀，協助同學實際體驗自我照顧的方法。課程後段則安排學生動手製作屬於自己的靜心瓶，作為情緒安定與覺察的具體媒介。"
          },
          activities: [
            {
              title: "活動一：自我照顧覺察書寫與刪減練習",
              content: "活動開始時，講師先說明情緒照顧的背景與重要性，並播放科技應用的實例影片，介紹如何透過 VR 技術協助長者改善憂鬱情緒。接著請學生書寫七項能讓自己感到平靜或滿足、且對自身而言相當重要的事物。<br><br>完成書寫後，進入第二階段刪減練習，同學需從原先列出的七項中刪除四項；此階段可觀察到部分同學在抉擇時感到猶豫與掙扎。第三階段則再刪除兩項，最終只留下自己認為最重要的一項，並由同學輪流分享，協助大家更清楚覺察自身的核心需求與情感依附。"
            },
            {
              title: "活動二：五感靜觀與情緒調節練習",
              content: "在本活動中，講師先說明人類大腦偏向負向思考的機制，並強調正向思考需要透過練習逐步養成。透過狗狗實驗的案例，讓學生理解只要不放棄練習，思維模式便有機會從消極轉為積極。<br><br>課程中也播放多段常見的負向語言情境影片，例如責備、否定或傷害性的言語，並對照語句結構改為正向表達，讓學生觀察語言如何影響情緒與他人反應。正式進入五感靜觀練習前，講師先於講台前示範流程與口訣，帶領學生透過呼吸、聽覺、觸覺等方式，逐步安定身心。"
            },
            {
              title: "活動三：靜心瓶製作",
              content: "課程最後，學生動手製作屬於自己的靜心瓶。同學們自由選擇喜歡的裝飾素材進行設計，作品風格多元且富有個人特色，例如以金色與黃色亮片搭配呈現溫暖感受，或在瓶中加入個人英文名字作為象徵。完成後，多數同學對自己親手製作的靜心瓶感到相當滿意，也有同學發揮創意，搭配燈光效果為作品增添氛圍，使靜心瓶成為兼具情緒照顧與美感的創作成果。"
            }
          ]
        },
        12: {
          title: "第十二週: oh!Dear me 250天憂鬱症紀實情緒年史、情緒拼圖",
          photos: [
            {
              src: "img/class3/W12-1.png",
              caption: "老師播放一個情緒照顧的影片"
            },
            {
              src: "img/class3/W12-2.png",
              caption: "同學正在繪製情緒地圖"
            },
            {
              src: "img/class3/W12-3.png",
              caption: "同學在選擇兩張情緒卡"
            },
            {
              src: "img/class3/W12-4.png",
              caption: "同學正在繪製情緒地圖"
            }
          ],
          record: {
            summary: "本週課程延續第十週【oh! Dear me：250 天憂鬱症紀實情緒年史】與第十一週「情緒照顧／自我照顧」主題演講內容，進一步聚焦於文本與情緒經驗的細部探討。老師透過播放情緒相關演講影片，並安排學生聆聽與憂鬱症主題相關的歌曲，引導學生以多元感官方式理解情緒議題。課程中，學生需回顧自身的重要生命事件，搭配情緒卡的選擇，最後針對一件對自己特別有感的過去事件，完成約 200 字的情緒書寫。"
          },
          activities: [
            {
              title: "活動一：情緒地圖",
              content: "在活動開始前，老師先帶領學生更深入認識情緒相關議題，說明人們如何覺察情緒，以及憂鬱症患者與一般人在感受外在世界時的差異。課程中搭配演講影片與歌曲，讓學生以不同形式接收與理解情緒內容。<br><br>情緒地圖繪製時，學生以 X 軸作為時間線 、 Y 軸作為情緒強度（由負面至正面） ，回顧並標示 5 至 8 件對自己而言重要的生命事件。時間範圍多從小學、國中、高中等階段進行回想，並標註當下事件與對應的情緒狀態，協助學生整理情緒與生命經驗之間的關聯。"
            },
            {
              title: "活動二：情緒卡選擇與情緒書寫",
              content: "延續第一個活動，學生進行情緒卡抽取，選擇兩張與自己目前感受相近，或特別引起共鳴的情緒卡。透過閱讀卡片上對情緒的描述，學生進一步對照情緒地圖中所標示的生命事件，找出最有感、最具連結的情緒經驗。<br><br>最後，學生從情緒地圖中選擇一件對自己印象最深刻的事件，撰寫約 200 字的情緒回憶文字。書寫內容以四個引導問題為核心，包括：事件當時發生了什麼、自己的感受是什麼、如何看待當下的情緒，以及事件帶來的影響，引導學生以書寫方式整理與理解自身情緒經驗。"
            }
          ]
        },
        13: {
          title: "第十三週: 專家演講，因為我植得",
          photos: [
            {
              src: "img/class3/W13-1.png",
              caption: "老師說明這故事背景並讓同學朗讀"
            },
            {
              src: "img/class3/W13-2.png",
              caption: "同學朗讀復原力的文本"
            },
            {
              src: "img/class3/W13-3.png",
              caption: "老師正在說明如何把植物哪出來"
            },
            {
              src: "img/class3/W13-4.png",
              caption: "同學正在製作水苔球"
            }
          ],
          record: {
            summary: "第十三週課程以專家演講為主軸，主題為「因為我值得」，邀請專家講師帶領學生認識「因為值得」的核心概念，並結合園藝治療進行體驗式學習。課程中透過多元活動，引導學生探索自我價值，思考自身特質，以及在不同人際關係中最喜歡、最渴望的愛的表達方式，同時也反思自己希望被他人如何對待，才能感到自在與被理解。課程最後安排水苔球製作，讓學生透過與植物互動，體驗療癒與陪伴的感受，並將自我照顧延伸至日常生活中。"
          },
          activities: [
            {
              title: "活動一：閱讀〈達利 B 的旅程〉—與自己對話、探索自我特質",
              content: "活動開始時，老師引導學生閱讀投影上的故事〈達利 B 的旅程〉。故事內容以動物之間的對話為主軸，描述角色在旅程中不斷詢問與探索「我是誰」、「我扮演什麼角色」，藉由動物們的互動呈現自我認同的過程。故事中也提到兔子因為自身獨特的優勢（如大腳的特質），成功拯救夥伴，並成為他人眼中的英雄，象徵每個人都擁有值得被看見的特質。<br><br>閱讀結束後，老師引導學生進行自我反思與書寫，包含以下方向：成長過程中是否曾對自我存在產生疑惑、自身的特質與喜好為何、「我是誰？我喜歡什麼？」的自我探問。最後，學生需寫下三項屬於自己的正向特質，並思考這些特質如何展現在與他人的互動中，或與自身的價值與道德選擇相關。"
            },
            {
              title: "活動二：特質轉換與愛的表達方式探索",
              content: "在第二個活動中，老師向學生介紹特質卡，逐一說明各項特質的意涵，並引導學生思考如何將原本被視為負面的特質，轉換為較為正向的表達方式。例如，將「過於依賴」重新詮釋為「對他人具有信任感」，協助學生重新看待自身特質。<br><br>接著，老師介紹「五種愛的表達方式」，包括：肯定的語句、肢體接觸、贈送禮物、服務的行動、精心時刻。學生需先在紙本上選出自己最喜歡的前三種被愛的方式，再進行 30 題的「愛之語」線上測驗。測驗結果會呈現五種表達方式的排序，讓學生能對照測驗結果與先前選擇是否一致，進一步理解自己在人際關係中的情感需求。"
            },
            {
              title: "活動三：水苔球製作（園藝治療體驗）",
              content: "課程最後，學生進行水苔球製作體驗。每位同學可依個人喜好選擇植物進行創作，老師亦準備多樣小型裝飾素材，讓學生自由搭配設計。透過親手製作水苔球，學生不僅體驗到園藝療癒的過程，也將「因為我值得被好好對待」的概念，具體轉化為能長期陪伴自己的植物作品。"
            }
          ]
        }
      }

};